[
  {
    "pergunta": "A arquitetura de software corporativa nasceu em meados dos anos 1980 e 1990 para suprir uma necessidade muito forte das empresas e projetos que estavam sendo desenvolvidos. Nesta época, começaram a surgir os primeiros frameworks arquiteturais no mercado.Considerando essas informações e o conteúdo estudado sobre framework arquitetural, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s):I. (  ) O framework criado por Zachman foi o primeiro framework arquitetural publicado e serviu de base para vários outros frameworks.II. (  ) O DoDAF é um framework criado para o Ministério de Defesa norte-americano e teve como base o framework Zachman.III. (  ) O framework EAP foi o primeiro framework arquitetural publicado e serviu de base para vários outros frameworks.IV. (  ) O TOGAF é um framework criado pelo Governo Federal americano e é um dos frameworks mais conhecidos e utilizados.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "V, V, F, F."
  },
  {
    "pergunta": "A arquitetura de software é uma disciplina cada vez mais utilizada no processo de desenvolvimento de aplicação e soluções de software. Nesse sentido, os requisitos não funcionais são fatores extremamente importantes para a definição e desenho da arquitetura de software e para o entendimento de como deve ser avaliada a qualidade do software frente aos stakeholders e partes envolvidas.Considerando essas informações e o conteúdo estudado sobre requisitos não funcionais, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s):I. ( ) Performance é um tipo de requisito não funcional.II. ( ) Manutenibilidade é um tipo de requisito não funcional.III. ( ) Usabilidade é um tipo de requisito funcional.IV. ( ) Confiabilidade é um requisito de negócio que é identificado junto ao usuário. ",
    "resposta": "V, V, F, F."
  },
  {
    "pergunta": "A automação, dentro de uma análise arquitetural, é utilizada a fim de se definir qual nível de automação se pode alcançar. Dessa forma, podemos identificar 3 tipos de automação dentro do contexto de formalização: Manual, Parcialmente Automática e Totalmente Automática.Considerando as informações apresentadas e o conteúdo estudado sobre análise arquitetural e automação, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s).I. (  ) Automação Totalmente Automática é uma técnica que pode ser aplicada em qualquer análise arquitetural, mesmo com baixo grau de completude.II. (  ) Automação parcialmente automática pode ser utilizada na maioria das análises e é composta por uma parte de software e outra parte de interação humana.III. (  ) Automação manual é aplicada, geralmente, em análises baseadas em cenários, nos quais a automatização é complexa.IV. (  ) Tanto a automação totalmente automática, como a automação parcialmente automática, podem ser aplicadas em qualquer análise arquiteturalAgora, assinale a alternativa que apresenta a sequência correta:.",
    "resposta": "F, V, V, F."
  },
  {
    "pergunta": "A avaliação arquitetural é uma atividade complexa que demanda esforço e uma excelente compreensão de informações e do processo arquitetural. Para que sua realização possa ser melhor aproveitada, há algumas metodologias disponibilizadas de forma que se possa direcionar melhor a sua utilização no ciclo de desenvolvimento de um software.Considerando essas informações e o conteúdo estudado sobre projetos arquiteturais, analise as metodologias de avaliação arquitetural disponíveis a seguir e associe-as com suas respectivas características.1) SAAM.2) ATAM.3) ASAAM.(  ) Método de avaliação baseado em trade-offs, utilizando como base as definições e/ou decisões técnicas e gerenciais.(  ) É uma metodologia específica para ser utilizada na avaliação de estruturas orientadas a aspectos (SOA).(  ) Método de avaliação baseado na investigação e descrição dos cenários presentes na aplicação, que podem ser diretos ou indiretos.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "2, 3, 1. "
  },
  {
    "pergunta": "A formalização de uma análise arquitetural é utilizada a fim de se definir qual nível de detalhe se deseja alcançar dentro da análise. Dessa forma, podemos identificar 3 tipos de grau dentro do contexto de formalização: Informais, Semi-Formais e Formais.Baseando-se na informação apresentada e no conteúdo estudado sobre análise arquitetural e seus tipos de modelos, analise os conceitos de formalidade e automação na análise arquitetural a seguir e associe-os com suas definições:1) Modelos Informais.2) Modelos Semi-Formais.3) Modelos Formais.(  ) Prezam pela formalidade e automatização e são mais utilizados por stakeholders mais técnicos.(  ) Modelos que estão sujeitos a verificações manuais e que possuem ambiguidade e falta de detalhes.(  ) Define a maioria dos modelos utilizados, que possuem precisão parcial e podem ser aplicados em análises manuais e automáticas.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "3, 1, 2. "
  },
  {
    "pergunta": "A modelagem arquitetural é uma abordagem muito utilizada e importante no processo de desenvolvimento de uma arquitetura de software. Dentro dessa abordagem, temos o mapeamento e o levantamento de várias informações importantes que serão utilizadas para nortear o desenvolvimento do software seguinte ou, tecnicamente falando, a arquitetura proposta.Considerando essas informações e o conteúdo estudado sobre as estruturas de modelagem arquitetural, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s):I. ( ) Decisões Arquiteturais são informações capturadas em modelos arquiteturais. II. ( ) Decisões Técnicas são informações capturadas em modelos arquiteturais.III. ( ) Informações de Custos são informações capturadas em modelos arquiteturais. IV. ( ) Informações sobre estruturas de times são informações capturadas em modelos arquiteturais. ",
    "resposta": "V, V, F, F. "
  },
  {
    "pergunta": "Além da modelagem arquitetural, é muito importante que se identifiquem e realizem a modelagem dos estilos arquiteturais, que irão utilizar as decisões arquiteturais como base de sua construção. A utilização desse tipo de mapeamento traz grandes benefícios e vantagens para o processo como um todo como: visão mais clara do projeto, identificação dos pontos críticos da arquitetura, visão clara das decisões técnicas e arquiteturais, entre outras.Considerando essas informações e o conteúdo estudado sobre as estruturas de modelagem arquitetural, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s):I. ( ) A modelagem dos estilos arquiteturais dificulta a criação de um mapa evolutivo arquitetural.II. ( ) A modelagem dos estilos arquiteturais traz, em todos os casos, um alto custo de implementação em relação a modelagem arquitetural.III. ( )  ",
    "resposta":"F, F, V, V. "
  },
  {
    "pergunta": "Ao desenvolver um design de uma arquitetura de uma solução de software, o arquiteto deve desenvolver uma série de artefatos que pertencem à fase de design e definição da arquitetura.Considerando essas informações e o conteúdo estudado sobre arquitetura de software, analise as afirmativas a seguir:I. A definição dos requisitos de segurança é um artefato de responsabilidade do arquiteto de softwares.II. O documento de requisitos funcionais é um dos artefatos que devem ser entregues pelo arquiteto.III. O plano de implantação deve ser desenvolvido e entregue pelo arquiteto de softwares.IV. As definições de padrões tecnológicos da arquitetura e do projeto são realizadas pelo arquiteto de software.Está correto apenas o que se afirma em: ",
    "resposta": "I, III e IV. "
  },
  {
    "pergunta": "Ao desenvolver um design de uma arquitetura em uma solução de software, o arquiteto deve levar em consideração todas as decisões levantadas e as definições técnicas importantes para a modelagem arquitetural. Nesse ponto, quando as decisões técnicas e arquiteturais são tomadas, o arquiteto tem a possibilidade de utilizar as vantagens de se realizar a modelagem de um estilo arquitetural.Considerando essas informações e o conteúdo estudado sobre a modelagem dos estilos arquiteturais, analise as afirmativas a seguir. I. Um estilo arquitetural pode ser resumido em um conjunto de decisões arquiteturais que serão aplicadas em um determinado contexto de solução a ser desenvolvida.II. O estilo arquitetural é uma forma descentralizada de se manter uma referência aos conceitos arquiteturais.III. Os estilos, de uma forma geral, auxiliam na restrição e definição do escopo das decisões do projeto.IV. Os estilos arquiteturais impedem que as partes consigam ter uma visão generalizada do todo arquitetural.Está correto apenas o que se afirma em: ",
    "resposta": "I e III. "
  },
  {
    "pergunta": "Ao realizarmos a modelagem arquitetural e a utilização das estruturas disponibilizadas por ela, como as views e viewpoints, podemos encontrar alguns tipos de inconsistências que precisam ser endereçadas, categorizadas e tratadas dentro da modelagem arquitetural.Com base nessas informações e nos estudos de modelagem arquitetural, analise os tipos de inconsistências dispostos a seguir e associe-os às suas respectivas definições:1) Inconsistência Direta.2) Inconsistência de Refinamento.3) Inconsistência de Aspecto Estático vs Dinâmico.4) Inconsistência de Aspecto Funcional vs Não-Funcional.(  ) Nesse tipo de inconsistência, temos o cenário onde duas views de um mesmo sistema, mas com níveis de detalhe diferentes, apresentam proposições que são diretamente contraditórias.(  ) Ocorre quando uma view de aspecto estático se encontra em conflito com uma view de aspecto dinâmico.(  ) Esse tipo de inconsistência ocorre quando temos uma propriedade não funcional, identificada em uma view não funcional, ausente nas views funcionais do projeto.(  ) Nesse tipo de inconsistência, temos o cenário no qual duas views apresentam proposições diretamente contraditórias.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "2, 3, 4, 1. "
  },
  {
    "pergunta": "Ao se definir estratégias arquiteturais e criar seu design, a visão arquitetural continua sendo uma das formas mais importantes de se comunicar a arquitetura de uma solução para as diversas partes. A visão “4+1” vem, nesse sentido, para apresentar os tipos de visão e permitir que o arquiteto as utilize de forma que promova o melhor entendimento da arquitetura.Considerando as informações acima e o conteúdo estudado, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s).I. ( ) Na visão lógica, o diagrama de sequência é um dos diagramas associado a essa visão.II. ( ) Na visão de processos, o diagrama de sequência é um dos diagramas que representam essa visão.III. ( ) O diagrama de implantação é um diagrama associado à visão física.IV. ( ) O diagrama de atividades é um dos diagramas associados à visão de desenvolvimento.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta":"V, F, V, F. "
  },
  {
    "pergunta": "Ao se realizar a atividade de decomposição modular em um projeto arquitetural, é possível afirmar que há mais de uma forma de se realizar essa decomposição. Tudo irá depender do contexto implicado.Considerando essas informações e o conteúdo estudado sobre projetos arquiteturais, analise as afirmativas a seguir.I. Uma das formas de se realizar a decomposição modular é através do modelo orientado a objetos.II. O modelo de fluxo de dados é uma forma de se realizar a decomposição modular.III. A modelagem arquitetural é uma forma de se realizar a decomposição modular.IV. A decomposição modular é um pré-requisito para se realizar a modelagem arquitetural.Está correto apenas o que se afirma em: ",
    "resposta":"I e II. "
  },
  {
    "pergunta": "Ao trabalharmos com a modelagem arquitetural, devemos sempre entender que as estruturas arquiteturais são elementos complexos, pois buscam mapear e identificar todas as decisões importantes e decisões críticas em um sistema, levando em consideração todas as partes envolvidas. Tendo isto em mente, as viewpoints são estruturas que vieram para auxiliar a amplificar e clarear a visão arquitetural.Considerando essas informações e o conteúdo estudado sobre modelagens complexas, analise as afirmativas a seguir:I. Viewpoints são estruturas existentes na modelagem arquitetural que auxiliam na filtragem das informações.II. Uma viewpoint pode ser usada em várias estruturas arquiteturais, como a visão de implantação.III. Views são estruturas existentes na modelagem arquitetural que auxiliam no agrupamento das decisões do projeto, relacionadas por interesses comuns.IV. A ocorrência de cenários contraditórios entre views é improvável de ocorrer. Está correto apenas o que se afirma em: ",
    "resposta": "I e III. "
  },
  {
    "pergunta": "Ao trabalharmos com as visões arquiteturais, necessitamos de meios para que possamos expressar essas visões de forma que outros players entendam. A UML veio para auxiliar nesse assunto, disponibilizando diagramas que auxiliam a visualizar as visões de arquitetura.Considerando essas informações e o conteúdo estudado sobre visões arquiteturais, analise as afirmativas a seguir:I. Na UML, objetos são as entidades base para toda construção.II. Abstração representa a capacidade de herdar características de outras classes.III. Polimorfismo permite a classes de mais alto nível trocarem seu comportamento de acordo com a instância do filho.IV. A UML é considerada uma linguagem descritiva e funcional.Está correto apenas o que se afirma em: ",
    "resposta": "I e III. "
  },
  {
    "pergunta": "Ao utilizarmos a metodologia C4 para a prática de documentação arquitetural, é possível conquistar o benefício de poder utilizar os recursos dessa metodologia como, por exemplo, seus diagramas.Considerando essas informações e o conteúdo estudado sobre projetos arquiteturais e metodologia C4, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s). I. ( ) O diagrama de contexto é um dos tipos de diagrama que a metodologia C4 disponibiliza para ser utilizado.II. ( ) O diagrama de sequenciamento é um tipo de diagrama disponibilizado dentro da metodologia C4.III. ( ) Os diagramas de container são um dos tipos de diagrama que a metodologia C4 disponibiliza para ser utilizado.IV. ( ) Os diagramas de cadeia de responsabilidade são utilizados na metodologia C4.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "V, F, V, F. "
  },
  {
    "pergunta": "Apesar do modelo unificado e em cascata ter sido utilizado durante muito tempo em projetos de softwares, o seu custo e rigidez fez com que novas metodologias surgissem, como o modelo ágil. Caracterizado por sua informalidade e produtividade, o modelo ágil também possui pilares que auxiliaram em sua na concretização.Considerando essas informações e o conteúdo estudado sobre os pilares da metodologia ágil, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s). I. (  ) Um dos pilares do modelo ágil é uma preocupação maior com os indivíduos e interações do que com os processos e ferramentas.II. (  ) O levantamento e a análise de requisitos são um dos pilares da metodologia ágil.III. (  ) A preocupação com um software mais funcional do que com uma documentação mais detalhada e completa é um dos pilares da metodologia ágil.IV. (  ) Elaborar uma rápida resposta a mudanças, em vez de seguir um plano, é um dos pilares da metodologia ágil.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "V, F, V, V. "
  }, {
    "pergunta": "As técnicas genéricas são utilizadas constantemente na modelagem arquitetural e na forma como os aspectos capturados são representados em uma arquitetura de software. Nesse grupo, as técnicas são separadas em: Linguagem Natural, Gráficos Informais e UML. Baseando-se nessas informações e no conteúdo estudado sobre modelagem arquitetural, analise as opções a seguir, relacionadas aos tipos de representações que podem ser utilizadas na modelagem, e associe-as às suas respectivas definições:1) Linguagem Natural.2) Gráficos Informais.3) UML.(  ) Essa técnica envolve a possibilidade de utilização de diagramas de tipos diferentes compostos por elementos gráficos e textuais.(  ) Essa técnica utiliza um conjunto de diagramas pré-definidos e regras bem definidas de criação e modelagem.(  ) Esse tipo de técnico busca realizar a descrição dos conceitos utilizando vocabulários extensivos e informais, podendo mapear qualquer tipo de conceito sem um detalhamento mais aprofundado do mesmo.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "2, 3, 1. "
  }, 
  {
    "pergunta": "As técnicas genéricas são utilizadas constantemente, tanto na modelagem arquitetural como na forma com que os aspectos arquiteturais são capturados, de maneira que se tenha um modo de representação em uma arquitetura de software destes elementos. Esse grupo de técnicas são separadas em linguagem natural, gráficos informais e UML.Considerando essas informações e o conteúdo estudado sobre implementação arquitetural, analise as técnicas disponíveis a seguir e associe-as com suas respectivas características.1) Linguagem natural.2) Gráficos informais.3) UML.(  ) Essa técnica envolve a possibilidade de utilização de diagramas de diferentes tipos, compostos por elementos gráficos e textuais.(  ) Essa técnica utiliza um conjunto de diagramas pré-definidos e regras bem definidas de criação e modelagem.(  ) Essa técnica busca realizar a descrição dos conceitos utilizando vocabulários extensivos e informais.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "2, 3, 1. "
  },
  {
    "pergunta": "Basicamente, podemos dizer que arquiteturas multicamadas são arquiteturas do tipo cliente-servidor, nas quais as camadas de apresentação, aplicação e dados são fisicamente separadas. O uso mais comum e popular desse tipo de arquitetura se aplica em arquiteturas de 3 camadas.Considerando essas informações e o conteúdo estudado sobre padrões de arquitetura, pode-se afirmar que o padrão multi-camadas promove a redução da dependência entre módulos, porque: ",
    "resposta": "com a segregação da aplicação em camadas distintas, os profissionais de desenvolvimento têm a opção de trabalhar as camadas de forma independente, reduzindo o retrabalho em mudanças e implementações realizadas. "
  },
  {
    "pergunta": "Cada vez mais vemos os softwares necessitarem de formas ainda mais sofisticadas de se visualizar e acompanhar as alterações, erros e informações que são produzidos, de forma que se possa entender o comportamento e tomar decisões baseadas nestas informações.Considerando essas informações e o conteúdo estudado sobre projeto arquitetural, analise as afirmativas a seguir:I. A auditoria é um requisito não funcional que visa rastrear o uso do sistema e os eventos que ocorrem nele.II. A auditoria é um requisito não funcional que permite o aprimoramento da segurança de uma aplicação.III. O monitoramento é um requisito não funcional que está associado à capacidade de acompanhar, de forma constante, o comportamento do software, além de ter a capacidade de lidar com cenários inesperados e aumentar a disponibilidade.IV. O monitoramento é um requisito não funcional que permite o aprimoramento da segurança de acesso de uma aplicação.Está correto apenas o que se afirma em: ",
    "resposta": "I e III. "
  },
  {
    "pergunta": "Como qualquer processo de desenvolvimento de uma solução de software que realize a criação de sua estrutura arquitetural, a documentação arquitetural também possui algumas ferramentas que auxiliam em sua elaboração. O modelo C4, por exemplo, é uma forma de ferramenta que auxilia na estruturação e na organização da documentação.Considerando essas informações e o conteúdo estudado sobre a metodologia C4, analise as afirmativas a seguir.I. Containers são um dos pilares que definem a metodologia C4.II. UML é um dos pilares da metodologia C4.III. Componentes são um dos pilares que definem a metodologia C4.IV. Documentação funcional é um dos pilares da metodologia C4.Está correto apenas o que se afirma em: ",
    "resposta": "I e III. "
  },
  {
    "pergunta": "Como toda metodologia, o modelo ágil é composto por diversas técnicas e práticas que precisam ser aplicadas, a fim de formatar o seu comportamento ágil. Além disso, essas técnicas e práticas auxiliam na categorização dessa metodologia.Considerando essas informações e o conteúdo estudado sobre implementação arquitetural, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s). I. ( ) A utilização de equipes maiores e com mais profissionais é uma prática comum em metodologias ágeis.II. ( ) A utilização do modelo de equipes auto gerenciáveis é uma prática importante para o funcionamento da metodologia ágil.III. ( ) O uso do TDD (Test Driven Design) é uma técnica muito utilizada em metodologias ágeis.IV. ( ) Uma das práticas utilizadas em metodologias ágeis é a realização de grandes entregas, englobando um conjunto grande de alterações e implementações.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "F, V, V, F. "
  },
  {
    "pergunta": "Conectores são elementos úteis dentro do contexto da arquitetura de software, pois permitem ao arquiteto otimizar e aprimorar a interação de componentes da solução de software com outros componentes.Considerando as informações apresentadas e o conteúdo estudado sobre conectores arquiteturais, analise as afirmativas a seguir e a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s):I. ( ) Conectores permitem uma melhor integração com o usuário final, pois ajudam a aprimorar os componentes de tela.II. ( ) Conectores são importantes na arquitetura, pois criam mecanismos de integração com outros sistemas/componentes que possam necessitar se comunicar com o componente sendo desenvolvido.III. ( ) Conectores permitem aos componentes sendo desenvolvidos que se comuniquem com componentes e sistemas legados, mesmo com tecnologias distintas.IV. ( ) Conectores permitem aos componentes uma camada extra de segurança.Agora assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "F, V, V, F. "
  },
  {
    "pergunta": "Conectores são peças de muita importância para o desenvolvimento de aplicações e para a arquitetura de software em si. Na sua utilização, temos tipos diferentes de conectores que o arquiteto de software pode escolher de acordo com a necessidade da solução. Dessa forma, temos um modo muito eficiente de comunicação entre os componentes, promovendo uma melhor integração entre as partes.Considerando essa informação, e de acordo com o conteúdo estudado, analise as afirmativas a seguir:I. Os conectores podem ser divididos em dois tipos: simples e compostos.II. Os conectores simples podem conter outros conectores simples em sua estrutura.III. Os conectores compostos podem ser disponibilizados como bibliotecas.IV. Os conectores compostos podem conter outros conectores compostos.Está correto apenas o que afirma em: ",
    "resposta": "I e III. "
  },
  {
    "pergunta": "Considerando o contexto dos requisitos não funcionais e sua relação com o processo arquitetural, podemos dizer que os requisitos não funcionais possuem influência considerável nas decisões arquiteturais do projeto.Considerando essas informações e o conteúdo estudado sobre projeto arquitetural, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s).I. (  ) As estratégias de implementação são tipos de decisão que sofrem forte influência dos requisitos não funcionais.II. (  ) As decisões relacionadas a estratégias de pós-venda são decisões fortemente influenciadas pelos requisitos não funcionais.III. (  ) Design patterns fazem parte das definições técnicas do projeto e sofrem forte influência dos requisitos não funcionais.IV. (  ) As plataformas tecnológicas são decisões e definições de projeto que podem sofrer grandes alterações de acordo com os requisitos não funcionais do projeto.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "V, F, V, V. "
  },
  {
    "pergunta": "Dentro da estrutura do FEAF, além dos domínios sub arquiteturais, outros fatores são importantes para definir a estrutura deste framework arquitetural. Neste contexto, o FEAF possui quatro pilares importantes que são a base deste framework.Considerando essas informações e de acordo com o conteúdo estudado sobre framework arquitetural, analise as afirmativas a seguir.I. O Service Delivery é um dos primeiros pilares que suportam o framework arquitetural FEAF.II. A Functional Specification faz parte dos pilares que definem o framework arquitetural FEAF.III. O Resource Optimization é um pilar importante do FEAF, pois sua função é realizar a otimização do uso de recursos.IV. A Authoritative Reference é um dos pilares do DoDAF e da FEAF.Está correto o que se afirma em: ",
    "resposta": "I e III. "
  },
  {
    "pergunta": "Dentro da estrutura do framework arquitetural TOGAF, o ADM possui um papel fundamental, tanto por ser o elemento central da estrutura do framework quanto por prover uma gestão das informações e artefatos que serão criados e utilizados no processo.Com base nessas informações e nos estudos sobre framework arquitetural, analise as fases do ADM a seguir e associe-as a suas respectivas definições:1) Visão da arquitetura.2) Arquitetura de tecnologia.3) Governança da implementação.4) Gestão de requisitos.(  ) Encontra-se, literalmente, no centro do ADM, significando que cada uma das demais fases do ADM, ao mesmo tempo, gera novos requisitos de arquitetura, e utiliza como entrada os requisitos de arquitetura previamente identificados.(  ) Responsável pelo planejamento do projeto arquitetural que será executado na interação corrente do ADM.(  ) Nesta fase, haverá o detalhamento das necessidades de quais processos de negócio serão necessários para o atendimento das metas estratégicas.(  ) Sua principal atividade é a realização de revisões de conformidade, que são auditorias realizadas nos projetos identificados, a fim de garantir que estejam sendo executados de acordo com a arquitetura proposta.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "4, 1, 2, 3. "
  },
  {
    "pergunta": "Dentro de um contexto de desenvolvimento de uma aplicação, temos caminhos críticos definidores para o sucesso de uma determinada solução de software. A capacidade que um sistema tem de permitir a sua evolução de forma simples e transparente reflete um dos requisitos não funcionais mais importantes no conjunto de NFRs de um sistema.Considerando essas informações e o conteúdo estudado sobre projeto arquitetural, pode-se afirmar que o requisito não funcional mencionado no trecho é o de extensibilidade, porque: ",
    "resposta": "a solução deve permitir a modificação, ou extensão da solução, suportando pequenas alterações que ajudarão o aplicativo a se adequar aos detalhes de nível prático. "
  },
  {
    "pergunta": "Dentro do contexto de desenvolvimento de software e de projeto arquitetural, alguns requisitos não funcionais podem ser confusos e abstratos, gerando certa dificuldade e complexidade em seu entendimento e na proposta de uma solução.Considerando essas informações e o conteúdo estudado sobre projeto arquitetural, analise os requisitos não funcionais a seguir e associe-os a suas respectivas características:1)Segurança.2) Monitoramento.3) Auditoria.(  ) Ajuda a garantir a disponibilidade do sistema e a lidar com os cenários inesperados da produção.(  ) Implementa as medidas apropriadas para rastrear o uso do sistema e os eventos que ocorrem nele.(  ) Mecanismo integrado abrangente, que conecta assinatura, segurança no nível de inquilino, restrições de uso, restrições de dados, criptografia, privilégios de usuário e nível de função.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "2, 3, 1. "
  },
  {
    "pergunta": "Dentro do contexto de implementação arquitetural há um conjunto de conceitos e ferramentas que auxiliam, e muito, os times a conseguirem realizar um desenvolvimento mais produtivo e eficiente. Os padrões de projetos são técnicas, com eficácia comprovada, de estruturas de sistema e código que são extremamente úteis e eficientes para as implementações a serem realizadas.Considerando essas informações e o conteúdo estudado sobre implementação arquitetural e padrões de projetos, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s). I. (  ) Em um padrão de projeto, é opcional que as consequências da aplicação sejam explicitadas em sua descrição.II. (  ) Todo padrão de projeto deve definir, de forma clara, qual problema está solucionando, a solução e as consequências.III. (  ) Todo padrão de projeto deve apresentar, de forma clara, os elementos do projeto, suas ligações e suas responsabilidades.IV. (  )  ",
    "resposta": "F, V, V, F. "
  },
  {
    "pergunta": "Dentro do contexto de modelagem arquitetura, os aspectos possuem um papel muito importante, tanto na modelagem, quanto na arquitetura em si. Os aspectos podem ser separados em dois grupos: estáticos e dinâmicos.Considerando essas informações e o conteúdo estudado sobre os aspectos na modelagem arquitetural, analise as afirmativas a seguir. I. Os aspectos estáticos são aqueles que não estão relacionados ao comportamento do sistema durante sua execução.II. Os aspectos estáticos são mais complexos que os aspectos dinâmicos.III. Os aspectos dinâmicos são o oposto do estático e estão intrinsecamente relacionados ao comportamento do sistema durante sua execução.IV. Os aspectos dinâmicos são mais fáceis de se mapear, devido à sua dinamicidade. Está correto apenas o que afirma em: ",
    "resposta": "I e III. "
  },
  {
    "pergunta": "Dentro do contexto de um projeto arquitetural, é de fundamental importância que se documente todas as avaliações e informações importantes, tanto para o projeto quanto para a arquitetura que está sendo criada. Um documento arquitetural possibilita um acompanhamento mais preciso e mais confiável da arquitetura.Considerando essas informações e o conteúdo estudado sobre a documentação arquitetural, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s). I. (  ) Dentro da documentação arquitetural, a presença dos requisitos funcionais identificados é imprescindível.II. (  ) Dentro da documentação arquitetural, a descrição do papel de cada elemento do contexto arquitetural é imprescindível.III. (  ) Dentro da documentação arquitetural, é imprescindível a presença de elementos arquiteturais como estrutura de componentes, decisões técnicas e backlog técnico.IV. (  ) Detalhes técnicos e decisões técnicas são elementos opcionais na documentação arquitetural.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "F, V, V, F. "
  },
  {
    "pergunta": "Dentro do contexto do TOGAF, o ADM possui um papel centralizador, e sua utilização, ou ciclo de vida, é composta de várias fases e um processo bem definido de execução, onde temos um elemento central que é atendido por todas as fases.Considerando essas informações e o conteúdo estudado sobre framework arquitetural, pode-se afirmar que: ",
    "resposta": "O elemento central do ADM é a Gestão de Requisitos (Requirement Management). "
  },
  {
    "pergunta": "Dentro do contexto dos padrões de projetos, temos diversos padrões que podem ser aplicados em sua implementação arquitetural. Eles são separados em grupos que os classificam e servem para auxiliar na definição de sua finalidade dentro do projeto.Considerando essas informações e o conteúdo estudado sobre implementação arquitetural e padrões de projetos, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s). I. (  ) Prototype, Builder e Singleton são exemplos de padrões de projeto criacionais.II. (  ) Adapter, Bridge e Iterator são exemplos de padrões de projetos do tipo estruturais.III. (  ) Visitor, Mediator e Observer são exemplos de padrões de projetos do tipo comportamentais.IV. (  ) Singleton é um tipo de padrão de projeto que permite a criação de várias instâncias diferentes de uma mesma classe.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "V, F, V, F. "
  },
  {
    "pergunta": "Dentro do processo de confecção de um projeto arquitetural, os requisitos não funcionais desempenham um papel cada vez mais importante e decisivo na hora de se realizar a estruturação da arquitetura e de sua implementação.Considerando essas informações e o conteúdo estudado sobre projeto arquitetural, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s).I. (  ) Requisitos de desempenho são considerados requisitos não funcionais.II. (  ) Requisitos de confiabilidade são excluídos da categoria de requisitos não funcionais.III. (  ) Requisitos de interoperabilidade são considerados requisitos não funcionais.IV. (  ) Requisitos éticos são excluídos da categoria de requisitos não funcionais.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "V, F, V, F. "
  },
  {
    "pergunta": "Dentro do universo da arquitetura de software, constantemente temos a necessidade de realizar “conexões” com elementos externos, a fim de garantir o fluxo da informação e das ações necessárias para que o sistema funcione corretamente. Nesse contexto, utilizamos o conceito de conectores, que tem por definição a capacidade de realizar a transferência de controle e dados entre as partes.Considerando a informação apresentada e o conteúdo estudado sobre os conectores de software, analise as afirmativas a seguir:I. Facilitação é o tipo de serviço no qual conectores realizam a mediação entre componentes de uma interação.II. Coordenação é o tipo de serviço que facilita e permite a interação entre componentes heterogêneos pode ser realizadas.III. Comunicação é o tipo de serviço que suporta a transmissão de dados entre componentes através de blocos simples de informação.IV. Conversão é um tipo de serviço que permite a troca de controles entre componentes, permitindo que a thread de execução seja trocada entre as partes.Está correto apenas o que se afirma em: ",
    "resposta": "I e III. "
  },
  {
    "pergunta": "Dentro dos modelos arquiteturais e de sua utilização, são utilizadas linguagens notacionais para dar suporte ao arquiteto de software em suas atividades de modelar e expor as propriedades e aspectos de uma arquitetura de software. As linguagens notacionais podem ser genéricas ou ADL’s específicas.Considerando as informações apresentadas e o conteúdo estudado sobre modelagem arquitetural e os tipos de ADL, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s).I. (  ) Rapid é um tipo de ADL de 1ª geração.II. (  ) Koala é um tipo de linguagem genérica.III. (  ) UML é um tipo de linguagem genérica.IV. (  ) AADL é um tipo de ADL.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "V, F, V, V. "
  },
  {
    "pergunta": "Diagramas são importantes ferramentas no entendimento de fluxos e estruturas arquiteturais, bem como no comportamento que a solução apresentará quando estiver pronta. Uma das partes mais importantes para se ter clareza na apresentação é na estrutura do sistema que será desenvolvido. Para isso, diagramas UML do tipo estrutural são essenciais para garantir a clareza nesse tipo de explicação.Com base na afirmação apresentada e nos estudos sobre a UML, analise os diagramas a seguir e associe-os a suas respectivas definições:1) Diagrama de Classes.2) Diagrama de Objetos.3) Diagrama de Implantação.4) Diagrama de Componentes.( ) É praticamente um complemento do diagrama de classes e bastante dependente dele. O diagrama fornece uma visão dos valores armazenados pelos objetos de um diagrama de classes em um determinado momento da execução de um processo do software.( ) Determina as necessidades de hardware do sistema e as características físicas como servidores, estações, topologias e protocolos de comunicação.( ) Representa os componentes do sistema quando o mesmo for ser implementado em termos de módulos de código-fonte, bibliotecas, formulários, arquivos de ajuda, módulos executáveis e etc.( ) Define a estrutura das classes utilizadas pelo sistema, determinando os atributos e métodos que cada classe tem, além de estabelecer como as classes se relacionam e trocam informações entre si.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "2, 3, 4, 1. "
  },
  {
    "pergunta": "Diante da grande variedade de diagramas que a UML oferece para que se represente as visões arquiteturais, é importante que se saiba a utilidade de cada um dos tipos disponíveis, especialmente quando é necessário realizar a representação de fluxos em ordem temporal entre os componentes e o sequenciamento dos mesmos.Diante do texto apresentado e do conteúdo abordado na UML, analise as asserções a seguir e a relação proposta entre elas:I. Na UML, é comum termos que representar fluxos de interação de componentes na linha do tempo usando diagramas comportamentais. ",
    "resposta": "As asserções I e II são proposições verdadeiras, e a II é uma justificativa correta da I. "
  },
  {
    "pergunta": "Diante da grande variedade de informações que podem ser capturadas em uma modelagem arquitetural, a utilização de viewpoints auxilia na identificação de estruturas e views da solução. Entre vários aspectos, podemos identificar os físicos, lógicos, Implantação e outros.Diante do texto apresentado e do conteúdo abordado na modelagem complexa, analise as asserções a seguir e a relação proposta entre elas:I. Na modelagem arquitetural temos que realizar a captura das entidades físicas e suas conexões.Porque:II. Estruturas de viewpoints, como a Physical Viewpoint, irão utilizar essas informações.A seguir, assinale a alternativa correta: ",
    "resposta": "As asserções I e II são proposições verdadeiras, e a II é uma justificativa correta da I. "
  },
  {
    "pergunta": "Durante a fase de realização de um projeto arquitetural, em alguns momentos é identificada a necessidade de realizar sua decomposição sistêmica em módulos menores. Esses módulos irão auxiliar os arquitetos e projetistas na decisão relativa aos perfis das estruturas.Considerando essas informações e o conteúdo estudado sobre projetos arquiteturais, analise as asserções a seguir e a relação proposta entre elas.I. A identificação dos perfis dos componentes e subcomponentes de um sistema é realizada pelos arquitetos e projetistas.Porque:II. Os arquitetos e projetistas são as partes que possuem o maior conhecimento técnico e funcional do projeto.A seguir, assinale a alternativa correta: ",
    "resposta": "As asserções I e II são proposições verdadeiras, e a II é uma justificativa correta da I. "
  },
  {
    "pergunta": "Em qualquer sistema que se necessite desenvolver uma arquitetura de qualquer complexidade, é necessário que se possua uma metodologia para organizar a estrutura e artefatos, bem como um processo a ser aplicado e seguido a fim de que esta arquitetura seja compreensível.Considerando essas informações e o conteúdo estudado sobre framework arquitetural, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s):I. (  ) A adoção de frameworks organizacionais, apesar de sua organização e padronização, causaram impacto negativo na produtividade.II. (  ) A adoção dos frameworks arquiteturais gerou uma padronização de termos e linguagens organizacionais.III. (  ) Os frameworks arquiteturais possibilitaram uma maior organização das informações para o contexto arquitetural.IV. (  ) O framework EAP foi o primeiro framework arquitetural publicado e serviu de base para vários outros frameworks.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "F, V, V, F. "
  },
  {
    "pergunta": "Em relação aos requisitos não funcionais que possuem maiores interferências na arquitetura de software, podemos elencar segurança, interoperabilidade e configurabilidade como três grandes requisitos que podem alterar o rumo de uma arquitetura.Considerando essas informações e o conteúdo estudado sobre projeto arquitetural, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s).I. (  ) Segurança é um NFR que deve ser considerado como um mecanismo integrado e abrangente dentro da aplicação.II. (  ) A configurabilidade só é alcançável através da codificação extensiva.III. (  ) A interoperabilidade é um NFR que preza pela capacidade de se comunicar com outros sistemas, internos e externos, de forma transparente.IV. (  ) A configurabilidade é um NFR que preza pela capacidade de customizar, através de configurações e não de códigos, elementos como UI, autenticação, regras de negócio, entre outros.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "V, F, V, V. "
  },
  {
    "pergunta": "Em todo sistema ou solução baseada em software, é de extrema importância que o usuário ou cliente se sinta confortável ao utilizar o software e tenha uma experiência agradável ao fazer isso. Para isso, são necessárias boas diretrizes para implementar uma interface coerente e de fácil comunicação com o usuário do sistema.Considerando essas informações e o conteúdo estudado sobre os requisitos não funcionais, podemos dizer que o texto apresentado se refere ao conceito de usabilidade, porque: ",
    "resposta": "esse é o tópico responsável por lidar com o design da interface gráfica de interação a qual o usuário terá acesso. "
  },
  {
    "pergunta": "Em todo sistema ou solução baseada em software, é necessário que se realize uma verificação entre o custo e o benefício de se assumir algumas decisões e diretrizes em um modelo arquitetural. Essa verificação deve ser realizada interativamente em um projeto envolvendo as partes do projeto, buscando a identificação de informações importantes, como as decisões arquiteturais e as decisões técnicas. Dessa forma, é possível ter uma visão melhor e mais coerente do projeto e da arquitetura a ser realizada.Considerando as informações apresentadas e o conteúdo estudado sobre modelagem arquitetural, podemos dizer que o texto se refere ao conceito de modelagem dirigida a stakeholders, porque: ",
    "resposta": "a verificação das decisões e diretrizes e sua relação custo vs benefício é realizada pelo arquiteto e pelos stakeholders. "
  },
  {
    "pergunta": "Em um processo de desenvolvimento de software a confecção de um projeto arquitetural traz grandes vantagens, uma vez que o projeto arquitetural é responsável por empregar decisões e definições arquiteturais a fim de delinear como a arquitetura será construída.Considerando essas informações e o conteúdo estudado sobre projetos arquiteturais e suas características, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s). I. ( ) Um dos benefícios em se ter um projeto arquitetural é a melhora na comunicação com os usuários.II. ( ) Um dos benefícios de um projeto arquitetural é que ele pode ser reutilizado em larga escala. III. ( ) A utilização de projetos arquiteturais dificulta a análise sistêmica da arquitetura, pois aumenta o custo em relação ao tempo.IV. ( ) A utilização de um projeto arquitetural dificulta a sua reutilização, pois o projeto de software se limita a tratar da solução em desenvolvimento.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "V, V, F, F. "
  },
  {
    "pergunta": "O cloud lock-in (aprisionamento na nuvem) pode ser visto como a dependência entre uma aplicação e os recursos de um determinado provedor de computação em nuvem. Esse problema geralmente ocorre quando o provedor implementa um conjunto próprio de API (Application Programming Interface).” Fonte: SOUZA NETO, Manoel Veras de. Computação em Nuvem: Nova Arquitetura de TI. Rio de Janeiro. Brasport, 2015. p. 41.  Considerando essas informações e o conteúdo estudado, podemos afirmar que uma solução viável para a integração entre os mais variados provedores de serviços em nuvem é: ",
    "resposta": "estabelecer um padrão para os API’s, possibilitando aos desenvolvedores de aplicativos a chance de integração de diversas aplicações através da nuvem pública. "
  },
  {
    "pergunta": "Uma das formas mais conhecidas de se representar as visões de uma arquitetura de software é a 4+1 que, inclusive, foi a base do processo RUP e é muito utilizada ainda nas definições e estruturas arquiteturais e nas documentações provenientes da criação da arquitetura de software.”Fonte: Kruchten, P. The 4+1 view model of architecture. IEEE Software. 1995. (tradução do autor).A visão “4+1” disponibiliza para a utilização as visões: física, lógica, desenvolvimento e de processos. Baseando-se nessas informações e no conteúdo estudado sobre a visão 4+1, analise os tipos de visões a seguir e associe-os às suas respectivas definições:1) Visão Lógica.2) Visão de Processos.3) Visão de Desenvolvimento.4) Visão Física.(  ) Possui uma integração maior com os requisitos não funcionais e com a estrutura da solução.(  ) Auxilia no entendimento de como os processos interagirão com os componentes existentes.(  ) Tem como objetivo principal representar os requisitos comportamentais.(  )  ",
    "resposta": "4, 2, 1, 3. "
  },
  {
    "pergunta": " Além do modelo de pagamento por uso, os provedores de serviços de nuvem também oferecem às empresas diversos benefícios. As empresas podem usufruir de escalabilidade e flexibilidade, sem as limitações físicas de servidores locais, da confiabilidade de múltiplos Data centers com diversas redundâncias [...]” Fonte: MICROSOFT AZZURE. O que é um provedor de Serviços em Nuvem? Disponível em: <https://azure.microsoft.com/pt-br/overview/what-is-a-cloud-provider/>. Acesso em: 13/08/2019.  Esse trecho se refere às características da Computação em Nuvem. A partir dessas informações e do conteúdo estudado a respeito, podemos afirmar que a função do provedor de serviços é: ",
    "resposta": "entender como o seu ambiente pode ser adaptado às demandas dos clientes e apresentar instrumentos ligados à gestão e procedimentos arquitetados para a nuvem. "
  },
  {
    "pergunta": " As ações de validação, por exemplo, devem ser duplicadas com programação desenvolvida no lado do servidor. Dessa forma, JavaScript teria a função exclusiva de agilizar a validação sem necessidade de requisições do servidor. O usuário poderá desabilitar JavaScript no seu navegador [...]” Fonte: SILVA, Maurício Samy. JavaScript – Guia do Programador: São Paulo: Novatec. 2010, p. 488.  Considerando essas informações e o conteúdo estudado sobre a utilização do JavaScript, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s).  I. ( ) O JavaScript desenvolve aplicativos do lado do servidor, de forma esporádica, parecidos com aqueles que criamos utilizando a rede.  II. ( ) O JavaScript pode limitar as aplicações do lado do cliente, onde é possível compará-lo aos aplicativos de desktop quanto ao requisito diversidade.  III. ( ) O JavaScript tem a capacidade de criar aplicações originadas do SPA, adequadas em uma exclusiva página da Web.  IV. ( ) Se aplica o JavaScript como uma maneira de ressaltar a experiência do cliente que emprega os aplicativos SaaS concentrados no servidor.  Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "F, F, V, V. "
  },
  {
    "pergunta": " Assim, a sociedade da informação significa, dentre outros possíveis significados, o ingresso da sociedade em um novo patamar histórico de produção, com um perfil de riquezas e valores, dentre eles a informação que, mais do que certificar-nos da prioridade das regras do mercado, redefine identidades e relações dos usuários.” Fonte: OLIVEIRA, Joaquim Humberto Coelho de; GONÇALVES, Carla Ferreira. Do modelo de sociedade industrial ao de sociedade da informação: proteções jurídicas às inovações tecnológicas. Disponível em: <http://publicacoes.unigranrio.edu.br/index.php/rdugr/article/view/1393/720>. Acesso em: 11/07/2019.  O trecho apresentado aborda a importância que a sociedade da informação adquiriu e a sua influência no novo modelo de produção. A partir dessas informações e do conteúdo estudado a respeito, podemos afirmar que a diferença básica no comportamento da sociedade industrial em relação à sociedade do conhecimento ocorre pelo fato de: ",
    "resposta": "a sociedade industrial apresentar uma produção potencializada através das máquinas, diferente do que ocorre nas sociedades do conhecimento, que se caracterizam pela capacidade de criação. "
  },
  {
    "pergunta": "Cerca de 28,7 milhões de lares brasileiros (quase 40% do total) contam com o serviço de banda larga fixa. Mas, diferentemente do telefone fixo e do celular, o mercado da banda larga fixa vai, cada vez mais, além das empresas de grande porte, com presença nacional. Os provedores regionais, somados a pequenas e médias empresas, representam uma importante parcela desse mercado.” Fonte: ANATEL. Provedores regionais e de pequeno porte expandem banda larga. Disponível em: <https://www.anatel.gov.br/consumidor/component/content/article?id=704:provedores-regionais-e-de-pequeno-porteexpandem-banda-larga>. Acesso em: 03/08/2019.  O trecho apresentado aborda a abrangência dos provedores de banda larga. Assim, e considerando os conteúdos estudados, analise as afirmativas a seguir sobre algumas potencialidades de um serviço na nuvem:  I. A AWS (Amazon Web Services) é um provedor que lidera o mercado e apresenta uma quantidade elevada de DataCenters e sua extensa abrangência.  II. A Google Cloud se caracteriza por disponibilizar recursos que visam atender as extensas solicitações ou as estruturas menores com a possibilidade de verificação.  III.  ",
    "resposta": "I e III. "
  },
  {
    "pergunta": "Com IaaS, não há necessidade de manter e atualizar software e hardware ou solucionar problemas com equipamentos. Com o contrato apropriado no lugar, o provedor de serviços garante que sua infraestrutura seja confiável e atenda aos SLA’s.”  Fonte: MICROSOFT AZURE. O que é IaaS? Disponível em: <https://azure.microsoft.com/pt-br/overview/what-is-iaas/>. Acesso em: 21/07/2019.   O trecho apresentado aborda um dos benefícios que o IaaS traz para a organização. A partir dessas informações e do conteúdo estudado, é possível verificar que uma das principais vantagens oferecidas pelo IaaS é: ",
    "resposta": "possibilitar aos gestores da organização que se dediquem apenas aos negócios. "
  },
  {
    "pergunta": "Medem o tempo necessário para o serviço do Cloud Spanner processar uma solicitação. A métrica captura a quantidade real de tempo decorrido, não a quantidade de tempo de CPU que o Cloud Spanner utilizou.” Fonte: Google Cloud. Métricas de latência. Disponível em: <https://cloud.google.com/spanner/docs/latency?hl=pt-br>. Acesso em: 13/08/2019. Com base nessas informações e no conteúdo estudado sobre serviços em nuvem, pode-se afirmar que o trecho apresentado se refere ao conceito de: ",
    "resposta": "latência. "
  },
  {
    "pergunta": "Na década de 1970, o domínio dos mainframes começou a ser desafiado pelo surgimento dos microprocessadores. O chip Intel 4004, lançado em 1971, era uma unidade central de processamento de quatro bits e o primeiro microprocessador disponível comercialmente. As inovações facilitaram enormemente a tarefa de desenvolver e fabricar computadores de menor porte.” Fonte: TIGRE, Paulo Bastos; NORONHA, Vitor Branco. Do mainframe à nuvem: inovações, estrutura industrial e modelos dos negócios nas tecnologias da informação e da comunicação. Disponível em: <http://www.scielo.br/pdf/rausp/v48n1/09.pdf>. Acesso em: 11/07/2019.  O trecho apresentado aborda a linha evolutiva das inovações tecnológicas, com a chegada dos microprocessadores após os mainframes, na década de 1970. Isso posteriormente desencadeou o modelo de Computação em Nuvem. Assim, e considerando os conteúdos estudados sobre a evolução histórica até a Computação em Nuvem, analise as afirmativas a seguir:  I. Na década de 1970, os microprocessadores foram essenciais ao desenvolvimento dos microcomputadores e do setor ligado à tecnologia da época.  II. Na década de 1990, a disseminação da internet se encontrava em larga escala, pois apresentava aspectos importantes, como uma infraestrutura e uma linguagem uniforme.  III. Os anos 1980 são marcados pelo surgimento de máquinas que apresentavam a habilidade de processar dados rotineiros e de expor o próprio processamento.  IV. No início dos anos 2000, temos a introdução da linguagem W.W.W (World Wide Web), que ampliou o uso da rede IP em uma escala local.  Está correto apenas o que se afirma em: ",
    "resposta": "I e III. "
  },
  {
    "pergunta": "Não é surpresa que a segurança continue a ser um problema com a tecnologia de nuvem, especialmente agora com a introdução das leis de proteção de dados GDPR na Europa e LGPD no Brasil. Dadas as vantagens da computação em nuvem, muitas empresas provavelmente se apressarão sem considerar seriamente as implicações de segurança.” Fonte: MATTOS, Carlos. 3 desafios de Cloud Computing para 2019. Disponível em: <https://cio.com.br/3-desafios-de-cloud-computing-para2019/>. Acesso em: 11/07/2019  Considerando essas informações e o conteúdo estudado sobre o tema, analise os objetivos da Computação em nuvem e associe-os com suas respectivas características:   1) Disponibilidade do serviço. 2) Dados em lockin. 3) Confidencialidade e Auditabilidade. 4) Bugs em larga escala em sistema distribuídos. 5) Lista de reputação.  ( ) Caracterizase por padronizar os APIs, possibilitando aos desenvolvedores de aplicativos a integração de diversas aplicações.  ( ) Tem como alternativa de solução a utilização de algoritmos criptografados apresentados na infraestrutura da nuvem.  ( ) Tem como finalidade fechar contratos com mais de um provedor de serviços nuvem e implementar a aplicação de dados.  ( )  ",
    "resposta": "2, 3, 1, 5, 4. "
  },
  {
    "pergunta": "O IBM Cloud Private é uma plataforma de nuvem escalável, que pode ser executada em qualquer infraestrutura local gerenciada pelo VMware ou pelo OpenStack, ou em qualquer ambiente de nuvem. O IBM Cloud Private se destina ao desenvolvimento e gerenciamento de aplicativos conteinerizados.” Fonte: AWS. Implantar o IBM Cloud Private na AWS com o novo Quick Start. Disponível em: <https://aws.amazon.com/pt/about-aws/whats-new/2019/02/deploy-ibm-cloud-private-onaws-with-new-quick-start/>. Acesso em: 13/08/2019.  Considerando essas informações e o conteúdo estudado, analise as características do IBM Cloud e relacione os itens dispostos a seguir:  1) Rede. 2) Transferência de Dados. 3) Largura de Banda. 4) Gerenciamento e Suporte.  ( ) Opções de gerenciamento e monitoramento incluídas.  ( ) 250 GB por mês de largura de banda pública de saída em todos os servidores virtuais mensalmente.   ( ) Largura de Banda de rede privada ilimitada em todos os servidores bare metal e virtuais.  ( ) Rede privada global integrada para fácil implementação e comunicação ininterrupta entre servidores.  Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "4, 3, 2, 1. "
  },
  {
    "pergunta": "Para melhorar a confiança, uma das prioridades da arquitetura SaaS é a criação de uma arquitetura de dados que seja robusta e segura o bastante para satisfazer parceiros e clientes – preocupados com o controle dos dados empresariais. (vitais para terceiros) [...]” Fonte: VERAS, Manoel. Cloud Computing: Nova Arquitetura da Ti. Rio de Janeiro: Brasport. 2012. p. 197.  O trecho apresentado traz uma das características essenciais de uma arquitetura de dados. Com base nessas informações e no conteúdo estudado, pode-se afirmar que a propriedade de dados permite, dentre outros aspectos: ",
    "resposta": "a possibilidade de backup dos dados. "
  },
  {
    "pergunta": "São uma classe de algoritmos para a Criptografia que utilizam chaves criptográficas relacionadas para a decifração e a encriptação. A chave da encriptação é relacionada insignificadamente à chave de decifração, que podem ser idênticas ou ter uma simples transformação entre duas chaves.”  Fonte: SANTOS JÚNIOR, Alfredo Luiz dos. Quem mexeu no seu sistema? Segurança em sistemas de Informação. Rio de Janeiro: Brasport, 2008.  A partir dessas informações e do conteúdo estudado sobre métodos de segurança, é correto afirmar que o trecho se refere aos algoritmos da: ",
    "resposta": "Chave Simétrica. "
  },
  {
    "pergunta": "Segundo Ray Ozzie, diretor de desenvolvimento de Software da Microsoft, a era da nuvem já começou. Terá um impacto revolucionário na maneira como as pessoas lidam com a tecnologia e vai determinar a história da computação nos próximos cinquenta anos.”  Fonte: PORTAL EDUCAÇÃO. As Fronteiras da Computação em Nuvem. Disponível em: <https://www.portaleducacao.com.br/conteudo/artigos/informatica/as-fronteiras-da-computacao-em-nuvem/56186>. Acesso em: 21/07/2019.  Esse trecho se refere à importância e às tendências da computação em nuvem no futuro. A partir dessas informações e do conteúdo estudado a respeito, podemos afirmar que a Computação em Nuvem tem como característica: ",
    "resposta": "apresentar ferramentas capazes de armazenar o conteúdo elaborado virtualmente, através de um acesso online. "
  },
  {
    "pergunta": "Serviços de computação em nuvem devem controlar e otimizar os recursos de maneira automática, disponibilizando mecanismos para medir esses recursos utilizando um sistema de medida apropriado para o tipo de recurso sendo utilizado (por exemplo, quantidade de espaço de armazenamento, velocidade de comunicação, capacidade de processamento, número de usuários ativos, etc.).” Fonte: OPUS. Afinal, o que é Computação em Nuvem? E o que não é? Disponível em: <https://www.opus-software.com.br/afinal-o-que-e-computacao-em-nuvem-e-o-que-nao-e/>. Acesso em: 11/07/2019.  O trecho apresentado traz uma das características essenciais do modelo de cloud computing. Com base nessas informações e no conteúdo estudado sobre o tema, pode-se afirmar que a característica exposta no texto se refere a: ",
    "resposta": "serviços mensurados. "
  },
  {
    "pergunta": "Talvez você não saiba, mas Active Record é um pouco mais que a forma que o Rails se comunica com o banco de dados, ele é uma implementação Ruby de um padrão de design de projeto que leva o mesmo nome do ORM (Mapeamento Relacional de Objetos) do Rails”. Fonte: MEDIUM CORPORATION. O mínimo que você deveria saber sobre Active Record. Disponível em: <https://medium.com/theminimum/algumas-coisas-que-voc%C3%AA-deveria-saber-sobre-o-active-record-5534d17956d6>. Acesso em: 21/07/2019.  O trecho apresentado se refere à definição do Active Record e suas características principais de implementação. Assim, e considerando os conteúdos estudados, analise as afirmativas a seguir sobre as diferenças e vantagens do Active Record do Rails.  I. O Rails acrescenta, de maneira automática, os atributos, tomando como referência as colunas do banco de dados.  II. Os desenvolvedores necessitam determinar os seus requisitos em mais de um local.  III. As convenções onde são determinadas as nomenclaturas do Rails possibilitam que bancos de dados encontrem os campos exclusivos.  IV. O Rails adiciona validação de relacionamento através de uma linguagem externa.  Está correto apenas o que se afirma em: ",
    "resposta": "I e III. "
  },
  {
    "pergunta": "Taxa em que os dados são transmitidos. Ele também pode ser definido como a quantidade de dados movidos com êxito de um lugar para outro em um determinado período. A taxa de transferência é medida em bits por segundo (bps).” Fonte: INTEL. Largura de banda vs throughput vs velocidade vs taxa de conexão.  Disponível em: <https://www.intel.com.br/content/www/br/pt/support/articles/000026190/network-and-i-o/wireless-networking.html>. Acesso em: 13/08/2019.  A partir dessas informações e do conteúdo estudado sobre avaliação de serviços em nuvem, podemos afirmar que o trecho apresentado se refere ao conceito de: ",
    "resposta": "throughput. "
  },
  {
    "pergunta": " Um exemplo pode ser analisado em uma empresa que comercializa seus produtos pela internet em sistemas de e-comerce. Neles, é possível utilizar os recursos de nuvem pública, principalmente pela escabilidade e pela elasticidade.”  Fonte: VARELLA, Walter Augusto. Implementação e migração para computação em nuvem. SENAC. São Paulo. 2019. Página 10.   O trecho apresentado traz uma das características do uso da nuvem dentro sistema E-commerce. A partir dessas informações e do conteúdo estudado, é correto afirmar que uma das vantagens da utilização da nuvem pública é: ",
    "resposta": "nuvem híbrida. "
  },
  {
    "pergunta": "fica evidente que o SOA não deve ser utilizada para todo o tipo de aplicativo. Não podemos desenvolver um sistema pensando apenas em serviços, pois corremos o risco de introduzir redundância descontrolada no sistema.” Fonte: SAMPAIO, Cleuton. SOA e WEB Services em Java. Rio de Janeiro: Brasport, 2006. p. 19.  Considerando essas informações e o conteúdo estudado, podemos afirmar que o SOA se caracteriza por: ",
    "resposta": "voltar os dados codificados para o código JavaScript do lado do cliente. "
  },
  {
    "pergunta": "significa que um disco rígido potencial foi criado dentro de um ambiente físico por meio de um software específico e opera independentemente dele. Ter um hardware dentro de outro possibilita rodar sistemas operacionais e todo o tipo de programas.” Fonte: UOL MEU NEGÓCIO. MÁQUINA VIRTUAL X CONTAINERS: DIFERENÇAS E SEMELHANÇAS. Disponível em: <https://meunegocio.uol.com.br/academia/tecnologia/maquina-virtual-vm-x-containers-diferencas-esemelhancas.html#rmcl>. Acesso em: 21/07/2019.    A partir dessas informações e do conteúdo estudado, é correto afirmar que a IaaS pode ser conceituada como: ",
    "resposta": "estrutura baseada na virtualização dos recursos de computação. "
  },
  {
    "pergunta": "anunciou hoje a expansão do seu serviço de armazenamento ES2, para oferecer aos clientes um modelo de assinatura unificada em ambientes híbridos. A novidade permite que as empresas utilizem o melhor modelo de armazenamento como serviço da categoria, no local hospedado e na nuvem, sem a necessidade de gerenciar várias assinaturas ou adquirir capacidade separada ou sobreposta.” Fonte: EXAME. Empresa expande modelo de assinatura de armazenamento como serviço em ambientes híbridos. 2019. Disponível em: <https://exame.abril.com.br/negocios/dino/empresa-expande-modelo-deassinatura-de-armazenamento-como-servico-em-ambientes-hibridos/>. Acesso em: 04 ago. 2019.  O trecho apresentado trata das características de um dos modelos de armazenamento em nuvem (ES2). Considerando essas informações e o conteúdo estudado sobre os principais serviços de armazenamento em nuvem, analise os modelos disponíveis a seguir e associe-os com suas respectivas características.  1) Google Drive. 2) Dropbox. 3) Box. 4) ICloud.  ( ) Apresenta aspectos parecidos com o OneDrive, visto que disponibiliza um espaço maior de armazenamento através de convites para que amigos utilizem o serviço. ( ) Suporta uma série de diversas plataformas, mas é exclusivamente utilizado em aparelhos mobile. ( ) Apresenta uma proposta mais colaborativa pois vem se consolidando como a melhor opção para edição de conteúdo, disponibilizando um espaço de 10 GB. ( ) Apresenta aplicativos para serem utilizados em PC ou Mac que possibilitam realização de uploads e sincronização do computador. Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "2, 4, 3, 1. "
  },
  {
    "pergunta": "é possível assinar o serviço para monitorar o endereço “1drv.ms” e visualizar todos os links compartilhados do OneDrive da Microsoft que foram acessados pelos usuários que instalaram essas extensões. O link em si dá acesso ao documento compartilhado”. Fonte: ROHR, A. Extensões do Chrome e Firefox vazaram sites visitados por milhões de internautas. 2019. Disponível em: <https://g1.globo.com/economia/tecnologia/blog/altieres-rohr/post/2019/07/19/extensoes-do-chrome-efirefox-vazaram-sites-visitados-por-milhoes-de-internautas.ghtml>. Acesso em 04 ago. 2019.  O trecho apresentado trata de uma das funcionalidades do OneDrive. Considerando essas informações e o conteúdo estudado sobre os principais serviços de armazenamento em nuvem, pode-se afirmar que a sincronização de arquivos no OneDrive é: ",
    "resposta": "vantajosa, caso o sistema operacional do Windows esteja na versão 8 ou 8.1, devido ao serviço integrado e à automação de uma conta criada para o gerenciamento de arquivos. "
  },
  {
    "pergunta": "o mercado de hospedagem gerenciada no Brasil está se consolidando, com o negócio de hospedagem diminuindo em importância e abrindo espaço para serviços de nuvem privada e híbrida. A maioria dos provedores de hospedagem estão focados em manter sua base de clientes, mas sem atualizar seus serviços. “. Fonte: EXAME. Empresas no Brasil Mudam o Foco para Data Centers Híbridos. 2019. Disponível em: <https://exame.abril.com.br/negocios/releases/empresas-no-brasil-mudamo-foco-para-data-centers-hibridos/>. Acesso em: 04 ago. 2019. (Adaptado).  O trecho apresentado trata da importância da hospedagem gerenciada na nuvem. Considerando essas informações e o conteúdo estudado sobre a gestão de projetos em nuvem, pode-se afirmar que o gerenciamento de projetos consiste em: ",
    "resposta": "um conjunto de ferramentas que permite que a empresa crie uma série de habilidades particulares, objetivando o controle de situações complexas dentro de um ambiente. "
  },
  {
    "pergunta": "A centralização do armazenamento na nuvem cria uma enorme vantagem para novos casos de uso. Ao usar as políticas de gerenciamento do ciclo de vida do armazenamento em nuvem, você poderá executar tarefas importantes de gerenciamento de informações”. Fonte: AWS. Armazenamento em Nuvem. Disponível em <https://aws.amazon.com/pt/what-is-cloud-storage/>. Acesso em: 04 ago. 2019.  Considerando essas informações e o conteúdo estudado sobre gerenciamento de projetos, analise as vantagens do gerenciamento de projetos na nuvem disponíveis a seguir e associe-as com suas respectivas características.  1) Implementação rápida. 2) Custo reduzido. 3) Ausência de departamentos de TI. 4) Flexibilidade. 5) Diversidade de opções de serviço.  ( ) Softwares que pouco impactam no planejamento financeiro das organizações.  ( ) Softwares desenvolvidos pela própria organização, sem a necessidade de um especialista em programação.  ( ) Possibilita a aplicação de softwares e dados de maneira mais veloz.  ( ) Torna possível testar as opções de softwares disponíveis até a organização encontrar a que melhor a atenda.  ( ) Possibilita acessar informações a partir de qualquer dispositivo móvel.  Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "2, 3, 1, 5, 4. "
  },
  {
    "pergunta": "A cloud computing, muitas vezes referida como simplesmente ‘a cloud’, é a entrega de recursos de computação sob demanda, tudo, desde aplicativos até data centers, por meio da Internet, com pagamento pay-per-use.” Fonte: IBM. Cloud Computing: Um guia Completo. Disponível em: <https://www.ibm.com/br-pt/cloud/learn/what-is-cloud-computing>. Acesso em: 11/07/2019.  O trecho apresentado traz o conceito de Cloud Computing, considerando-o como um serviço de internet disponível. Com base nessas informações e no conteúdo estudado sobre as características da aplicação em nuvem, analise as afirmativas a seguir e assinale V para a (s) verdadeira(s) e F para a(s) falsa(s).  I. ( ) No autosserviço sob demanda, os recursos estão disponibilizados por meio da internet e padrões.  II. ( ) O acesso à rede ampliado se caracteriza pela não interferência humana agindo nos provedores dos serviços apresentados.  III. ( ) No conjunto de recursos, é possível verificar que os provedores da computação em nuvem agrupam atributos, possibilitando o atendimento a diversos clientes.  IV. ( ) A elasticidade rápida se observa em uma quantidade expressiva de recursos que são obtidos na medida desejada de acordo com a requisição.  Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "F, F, V, V. "
  },
  {
    "pergunta": "A Cloudflare acredita que a arquitetura é importante e é a única solução contra botnets massivamente distribuídos e uma rede massivamente distribuída. A Cloudflare baseou seu serviço nessa abordagem de arquitetura e, embora haja limites para qualquer serviço, até agora a Cloudflare não foi atingida por nenhum ataque de botnet de IoT.” Fonte: CLOUDFLARE. RECURSOS. Disponível em: <https://www.cloudflare.com/pt-br/resources/>. Acesso em: 21/07/2019. (adaptado).  O trecho apresentado aborda aspectos referentes à plataforma Cloudflare e à arquitetura adotada. A partir dessas informações e do conteúdo estudado a respeito, podemos definir que a arquitetura multicliente se caracteriza por: ",
    "resposta": "utilizar recursos de forma compartilhada, desde que seja possível dar suporte a vários usuários, simultaneamente. "
  },
  {
    "pergunta": "A computação em nuvem é o fornecimento de serviços de computação, incluindo servidores, armazenamento, bancos de dados, rede, software, análise e inteligência, pela Internet (‘a nuvem’) para oferecer inovações mais rápidas, recursos flexíveis e economias de escala.” Fonte: MICROSOFT AZURE. O que é computação em nuvem. Disponível em: <https://azure.microsoft.com/pt-br/overview/what-is-cloud-computing/>. Acesso em 04 ago. 2019.  Considerando essas informações e o conteúdo estudado sobre a implementação de sistemas em nuvem, pode-se afirmar que um sistema na nuvem tem a função de: ",
    "resposta": "a) reduzir os riscos do investimento e auxiliar a empresa no uso de seus produtos de maneira eficiente. "
  },
  {
    "pergunta": "A construção da plataforma como serviço (PaaS) sobre a infraestrutura como serviço (IaaS) pode ajudar a melhorar a produtividade do desenvolvedor. À medida que cresce a adoção da PaaS, o investimento de TI e o custo total de propriedade devem diminuir.” Fonte: INTEL. O que é PaaS? Disponível em: <https://www.intel.com.br/content/dam/www/public/lar/br/pt/documents/articles/10217909-hybrid-cloud-paas-whitepaper-x1a-1-por.pdf>. Acesso em: 21/07/2019.  A partir dessas informações e do conteúdo estudado, é possível afirmar que o trecho apresentado se refere a uma vantagem do PaaS denominada: ",
    "resposta": "escabilidade. "
  },
  {
    "pergunta": "A ideia que está por trás do SaaS é oferecer aos clientes um acesso centralizado às informações, por um custo menor, se comparado a uma aplicação executando localmente. Mas desde que se queira obter vantagem de todos os benefícios SaaS, uma organização precisa adaptar seus próprios dados [...]”  Fonte: VERAS, Manoel. Cloud Computing: Nova Arquitetura da Ti. Rio de Janeiro: Brasport. 2012. p. 197. (adaptado)  O trecho apresentado traz as vantagens da implementação do SaaS em relação ao baixo custo. Considerando essas informações e o conteúdo estudado sobre as arquiteturas de aplicação SaaS, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s).  I. ( ) Arquitetura Cliente-Servidor é conhecida pelo fato dos Navegadores web e servidores estabelecerem um contato por meio do (HTTP).  II. ( ) Na Representação HTML e CSS, o software cliente tem a especialidade de criar uma interação com o usuário e emitir solicitações diretamente para o servidor representando este usuário.  III. ( ) Cascading Style Sheets (CSS) é definida como uma linguagem de folhas de estilos que expõe os atributos gráficos de um item que forma uma página Web.  IV. ( ) Estabelecer uma diferenciação entre os modelos que praticam a lógica do negócio é a característica essencial referente ao padrão MVC.  Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "F, F, V, V. "
  },
  {
    "pergunta": "A multilocação é o que diferencia a computação na nuvem em relação à terceirização ou a modelos de provedores de serviços de aplicativos mais antigos. Agora, as empresas de pequeno porte têm a capacidade de dominar o poder da tecnologia avançada de maneira dimensionável.” Fonte: Salesforce. Cloud computing – Aplicativos em um toque. Disponível em: <https://www.salesforce.com/br/cloud-computing/>. Acesso em: 14/08/2019.  A partir dessas informações e do conteúdo estudado, é possível afirmar que a multialocação é referente ao: ",
    "resposta": "ocasionar fraudes e situações de vulnerabilidade do sistema. "
  },
  {
    "pergunta": "A multilocação é o que diferencia a computação na nuvem em relação à terceirização ou a modelos de provedores de serviços de aplicativos mais antigos. Agora, as empresas de pequeno porte têm a capacidade de dominar o poder da tecnologia avançada de maneira dimensionável.” Fonte: Salesforce. Cloud computing – Aplicativos em um toque. Disponível em: <https://www.salesforce.com/br/cloud-computing/>. Acesso em: 14/08/2019.  A partir dessas informações e do conteúdo estudado, é possível afirmar que a multialocação é referente ao: ",
    "resposta": "compartilhamento de determinados recursos da nuvem com usuários variados. "
  },
  {
    "pergunta": "A nuvem pública é definida como uma série de serviços de computação oferecidos por terceiros à Internet pública, os quais são disponibilizados a qualquer pessoa que queira utilizá-los ou comprá-los. Eles podem ser gratuitos ou vendidos sob demanda, permitindo que os clientes paguem apenas pelo seu consumo de ciclos de CPU, armazenamento ou largura de banda. ”  Fonte: MICROSOFT AZURE. O que é uma nuvem pública? Disponível em: <https://azure.microsoft.com/pt-br/overview/what-is-apublic-cloud/>. Acesso em: 12/07/2019.   O trecho apresentado traz a definição de nuvem pública e de suas características. A partir dessas informações e do conteúdo estudado, é correto afirmar que uma das vantagens da utilização da nuvem pública é: ",
    "resposta": "o baixo custo e alto nível de agilidade para dar início a um negócio. "
  },
  {
    "pergunta": " A nuvem pública é definida como uma série de serviços de computação oferecidos por terceiros à internet pública, os quais são disponibilizados a qualquer pessoa que queira utilizá-los ou comprá-los. Eles podem ser gratuitos ou vendidos sob demanda, permitindo que os clientes paguem apenas pelo seu consumo de ciclos de CPU, armazenamento ou largura de banda.” Fonte: MICROSOFT AZURE. O que é nuvem pública? Disponível em: <https://azure.microsoft.com/ptbr/overview/what-is-a-public-cloud/>. Acesso em: 04 ago. 2019.  Considerando essas informações e o conteúdo estudado sobre modelos de implantação em nuvem, pode-se afirmar que uma das desvantagens do uso da nuvem pública é: ",
    "resposta": "o fato de que o compartilhamento entre usuários cria a possibilidade de gerar problemas relacionados a instabilidades temporárias. "
  },
  {
    "pergunta": "A Plataforma como um Serviço é um mecanismo para combinar IaaS com um conjunto abstrato de serviços de middleware, desenvolvimento de software e ferramentas de implantação que permitem que a empresa tenha uma maneira consistente de criar e implementar aplicativos em nuvem ou em premissas.”  Fonte: HURWITZ, Judith, NUGENT, Alan, DR. HALPER, Fern, KAUFMAN, Marcia. Big Data Para Leigos. Altas Books: Rio de Janeiro. 2016. p. 75.   O trecho apresentado se refere ao conceito e às características da Plataforma como um Serviço. Considerando essas informações e o conteúdo estudado, é possível afirmar que, no período anterior à introdução da PaaS, o ambiente tecnológico se caracterizava por: ",
    "resposta": "ser formado por uma variedade de fornecedores cuidando, particularmente, da sua funcionalidade individual. "
  },
  {
    "pergunta": "A questão de quando migrar para a nuvem é uma decisão de negócios, baseada em vários fatores exclusivos de cada organização. No entanto, um momento fundamental para considerar o uso da nuvem é quando a empresa está prestes a passar por uma expansão ou atualização.”  Fonte: MICROSOFT AZZURE. Migração na Nuvem. Disponível em: <https://azure.microsoft.com/pt-br/overview/cloud-migration/>. Acesso em: 13/08/2019.   Considerando essas informações e o conteúdo estudado, podemos afirmar que a migração para a nuvem é vantajosa por conta da: ",
    "resposta": "recuperação de dados e sistemas. "
  },
  {
    "pergunta": "A segurança da informação e a segurança de dados são medidas importantíssimas para qualquer empresa. Porém, nem todo gestor compreende exatamente o que a segurança da informação engloba e por que ela é tão importante. Eis a resposta: toda empresa lida diariamente com informações confidenciais. Normalmente, esses dados são importantíssimos e vitais para o bom funcionamento dos processos internos e externos. Essas informações transitam por toda a empresa e precisam ser manuseadas com cuidado.” Fonte: TERRA. Entenda o que é Segurança da Informação e reduza Riscos Empresariais. Disponível em: <https://www.terra.com.br/noticias/dino/entenda-o-que-e-seguranca-da-informacao-e-reduza-riscosempresariais,33a74eac2ad4a1b8023045001af70efapb2ew8ys.html>. Acesso em: 14/08/2019.    Considerando essas informações e o conteúdo estudado, analise os aspectos adotados pela segurança da Informação:  1) Isolamento de Dados. 2) Segurança referente aos dados. 3) Segurança de Rede. 4) Integridade de Dados.  ( ) Caracteriza-se pela adoção de propriedades relacionadas à Atomicidade, Consistência Isolamento e Durabilidade.  ( ) A segurança está sempre presente em toda a circulação de dados pela rede com o intuito de impedir que as informações sejam perdidas ou manipuladas.  ( ) Trata-se dos provedores de serviço que apresentam técnicas de segurança destinadas à proteção dos dados dos usuários.  ( ) Ocorre entre organizações empresariais e usuários distintos através de métodos de virtualização, por exemplo.  Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "4, 3, 2, 1. "
  },
  {
    "pergunta": "A segurança na nuvem não altera o método de gerenciamento da segurança, passando de ações de prevenção para ações de detecção e correção. No entanto, ela disponibiliza a capacidade de executar essas ações de modo mais ágil.” Fonte: AWS. O guia para iniciantes em segurança na nuvem. Disponível em: <https://aws.amazon.com/pt/security/introduction-to-cloud-security/>. Acesso em: 14/08/2019.  O trecho apresentado aborda as características da segurança na nuvem. Através das informações apresentadas pelo texto, e baseando-se no conteúdo estudado, é possível afirmar que um dos aspectos importantes em relação aos serviços de segurança visa: ",
    "resposta": "inserir um sistema de controle que seja capaz de restringir o acesso aos serviços ou os componentes aos indivíduos autorizados. "
  },
  {
    "pergunta": "A Spring Cloud possui uma stack completa de microservices, que foi construída e mantida pela Pivotal, lançou sua primeira versão em 2014 e é frequentemente atualizada. O objetivo principal do Spring Cloud é fornecer uma integração completa entre o Spring Boot e o projeto Netflix OSS“. Fonte: SALERNO, R. Desmistificando o Spring Cloud Netflix. 2017. Disponível em: <https://www.infoq.com/br/articlesdesmistificando-spring-cloud-netflix/>. Acesso em: 04 Ago 2019.  Considerando essas informações e o conteúdo estudado sobre os componentes do Spring Cloud, analise as afirmativas a seguir.  I. O Spring Cloud Config permite o armazenamento de aplicações com configurações dentro de um gerenciador de versões.  II. O Spring Cloud Netflix torna mais simples a integração e a utilização de servidores, como ocorre, por exemplo, com o RabbitMq.  III. O Spring Cloud For Cloud Foundry tem a função de promover a integração da aplicação aos serviços PaaS.  IV. O Spring Cloud Amazon Web Services é o componente responsável pela integração de aplicações desenvolvidas.  Está correto apenas o que se afirma em: ",
    "resposta": "I e III. "
  },
  {
    "pergunta": "A suspeita, Paige Thompson, 33, deixou uma trilha online para que os investigadores seguissem, e se vangloriou de suas ações como ‘hacker’, de acordo com documentos judiciais em Seattle, onde foi detida e acusada por fraude de computação e abuso”.  Fonte: FOLHA DE SÃO PAULO. Violação de dados de banco Capital One afeta 100 milhões de pessoas. Disponível em: <https://www1.folha.uol.com.br/tec/2019/07/violacao-de-dados-de-banco-capital-one-afeta-100-milhoes-de-pessoas.shtml>. Acesso em: 13/08/2019.  O trecho apresentado traz a ação de um hacker atuando na violação de dados. Considerando essas informações e o conteúdo estudado, é possível afirmar que a violação dos dados: ",
    "resposta": "a) gera custos que aumentam rapidamente dentro de ambientes da Tecnologia da Informação no que se refere à integração. "
  },
  {
    "pergunta": "Apesar de parecer similar ao Skype padrão, a versão Business traz algumas diferenças importantes para quem deseja utilizar o programa na sua empresa. O aplicativo tem como objetivo ser uma plataforma única para a companhia, com recursos de chamadas, conferências e vídeos, por exemplo. Dessa forma, todos os funcionários podem se conectar, usando um único software.” Fonte: PEREIRA, André Luiz de Mello Pereira. Skype for Business: conheça a versão empresarial do mensageiro. Disponível em: <https://www.techtudo.com.br/noticias/2018/01/skype-for-business-conheca-a-versao-empresarial-domensageiro.ghtml>. Acesso em: 11/07/2019.    O trecho apresentado fala sobre o Skype for Business, que oferece recursos integrados à nuvem. A partir dessas informações e do conteúdo estudado sobre o tema, pode-se concluir que esse serviço foi implantando pela Microsoft através da categoria de computação em nuvem que oferece meios que possibilitam a interação entre as pessoas denominado: ",
    "resposta": "CaaS. "
  },
  {
    "pergunta": "As grandes favorecidas foram as pequenas e médias empresas, que puderam ter acesso aos mesmos programas usados pelas gigantes. Mas o SaaS beneficiou companhias de todos os tamanhos, que passaram a usar o recurso na nuvem para ter acesso remoto a programas e armazenar arquivos de forma descomplicada.” Fonte: PEGN. Já ouviu falar em saas? Conheça um mercado repleto de oportunidades para empreendedores. Disponível em: <https://revistapegn.globo.com/Tecnologia/noticia/2018/11/ja-ouviu-falar-em-saas-conheca-um-mercado-repleto-deoportunidades-para-empreendedores.html>. Acesso em: 11/07/2019. ",
    "resposta": "pelo fato de o provedor de serviços ser o responsável pela implantação e gestão de toda infraestrutura disponível. "
  },
  {
    "pergunta": "Atualmente, o próprio WhatsApp possui uma criptografia de ponta a ponta, o que protegeria as mensagens em caso de invasão, tornando-as incompreensíveis para pessoas externas. No entanto, a prática de pessoas fazerem o backup das mensagens e fotos em nuvens (como Google Drive e Dropbox, por exemplo) torna o conteúdo vulnerável por meio de outras plataformas. Sendo assim, em uma possível tentativa, o invasor consegue ter acesso a todas as mensagens passadas.” Fonte: CAPETTI, Pedro. Sem WhatsApp e Telegram: Abin tem celular com tecnologia que protege presidente e ministros de hackers. Disponível em: <https://oglobo.globo.com/brasil/sem-whatsapp-telegram-abin-tem-celular-com-tecnologia-que-protegepresidente-ministros-de-hackers-23736185>. Acesso em: 11/07/2019.   O trecho cita uma das funcionalidades do Dropbox, que utiliza os serviços DaaS. Considerando as informações apresentadas e os conteúdos estudados sobre o tema, é possível afirmar que uma das características principais da categoria de serviço DSaaS é: ",
    "resposta": "provisionar e armazenar dados. "
  },
  {
    "pergunta": "Capacidade que o provedor tem de oferecer uma infraestrutura de processamento e armazenamento de forma transparente. Neste cenário, o usuário não tem o controle da infraestrutura física, mas, através de mecanismos de Virtualização, possui controle sobre as máquinas virtuais, armazenamento, aplicativos instalados e possivelmente um controle limitado dos recursos de rede.” Fonte: VERAS, Manoel. Cloud Computing: Nova Arquitetura de TI. Rio de Janeiro: Brasport, 2012. p. 35.  Considerando as informações apresentadas e os conteúdos estudados sobre o tema, é possível afirmar que a descrição do trecho se refere ao modelo de serviço denominado: ",
    "resposta": "IaaS. "
  },
  {
    "pergunta": "Chamado de ‘Cloud Download’, esta nova ferramenta servirá para fazer a restauração do sistema operacional no caso de falhas ou quando ele precisar ser reinstalado. O recurso é semelhante a uma ferramenta disponível do sistema MacOs, da Apple.” Fonte: CURY, M. Microsoft testa serviço de recuperação em nuvem no Windows 10. 2019. Disponível em: <https://exame.abril.com.br/tecnologia/microsoft-testa-servico-de-recuperacao-em-nuvem-no-windows-10/>. Acesso em: 04 ago. 2019. (Adaptado).  O trecho apresentado trata de um recurso do Windows, disponibilizado para recuperação sistêmica. Considerando essas informações e o conteúdo estudado sobre o processo de implementação, pode-se afirmar que a computação em nuvem abrange: ",
    "resposta": "ações que vão desde o armazenamento de backups até a execução de sistemas dentro das empresas, visando custos reduzidos e alta produtividade. "
  },
  {
    "pergunta": "Com a melhoria no cenário econômico vem também a necessidade de adequação à Lei Geral de Proteção de Dados (LGPD). A Lei visa regulamentar o uso dos dados pessoais dos consumidores pelas empresas, e entrará em vigência a partir de agosto de 2020. As empresas que coletam dados dos clientes, seja no ambiente físico ou virtual como as redes sociais ou as plataformas de e-commerce, serão inteiramente responsáveis pelo processamento, arquivamento e utilização dos dados.” Fonte: EXAME. Lei Geral de Proteção de Dados (LGDP): qual é seu impacto no varejo? Disponível em: <https://exame.abril.com.br/negocios/dino/lei-geral-de-protecao-de-dados-lgdp-qual-e-seu-impacto-no-varejo/>. Acesso em: 14/08/2019.  O trecho apresentado aborda a Lei Geral de Proteção de Dados (LGDP) e o seu impacto no varejo. A partir dessas informações e do conteúdo estudado a respeito, é possível entender que a proteção dos dados está relacionada: ",
    "resposta": "a) à presença de hackers que visam adquirir vantagens ilegais do sistema, trazendo danos de ordem moral e financeiros aos outros indivíduos. "
  },
  {
    "pergunta": "Com a virtualização de dados, é possível consultar dados em vários sistemas sem precisar copiar e replicar dados, o que reduz os custos. Ele também pode simplificar sua análise, além de mantê-la atualizada e precisa, porque você está consultando os dados mais recentes em sua origem.” Fonte: IBM. Virtualização de Dados.  ",
    "resposta": "um espaço de armazenamento de dados contínuos e configuráveis. "
  },
  {
    "pergunta": "Conforme a World Backup Day, 30% das pessoas nunca fizeram um backup, isto em um contexto altamente perigosos no qual, mensalmente, um computador em cada 10 é infectado por vírus, segundo dados da própria organização. As causas para a perda de dados podem ter origem tanto no hardware quanto no software dos equipamentos.”  Fonte: GAUCHA ZH. Este domingo é dia do backup: saiba como fazer uma cópia de segurança dos seus dados. Disponível em: <https://gauchazh.clicrbs.com.br/tecnologia/noticia/2019/03/este-domingo-e-dia-do-backup-saiba-como-fazer-uma-copia-deseguranca-dos-seus-dados-cjtwtox9c01ww01llnkegra03.html>. Acesso em: 14/08/2019.  Considerando as informações apresentadas e os conteúdos estudados, é possível afirmar que a ausência de uma cópia de segurança pode: ",
    "resposta": "gerar um conjunto de ações relacionadas à eliminação, à desvinculação dos registros ou à utilização de mídias não confiáveis para o armazenamento. "
  },
  {
    "pergunta": "Diversas organizações trabalham mutuamente para definir os padrões de segurança na nuvem. A abrangência vai desde a autenticação, até a autorização delegada, gerenciamento de chaves públicas, proteção contra perdas de dados e emissão de relatórios normativos.” Fonte: VERAS, Manoel. Cloud Computing: Nova Arquiteura da TI. Rio de Janeiro: Brasport, 2012. p. 49. (adaptado)  Considerando as informações apresentadas e os conteúdos estudados, é possível afirmar que o modelo de segurança no qual o contratante tem a função de garanti-la é a: ",
    "resposta": "segurança referente à Infraestrutura. "
  },
  {
    "pergunta": "É correto afirmar que o MultiCloud contempla, simultaneamente, diferentes infraestruturas, com o objetivo de fornecer um maior portfólio de ferramentas e liberdade de alteração de escopo, arquitetura e escala dos ambientes.” Fonte: EMBRATEL. Multicloud. Disponível em: <https://www.embratel.com.br/cloud/multicloud>. Acesso em: 04 ago. 2019.  Considerando essas informações e o conteúdo estudado sobre as tendências de nuvem corporativa, pode-se afirmar que o MultiCloud pode ser definido como: ",
    "resposta": "um serviço que envolve avaliação, implantação e gerenciamento em Cloud e que emprega a alternativa mais adequada para atender as demandas do negócio. "
  },
  {
    "pergunta": "É o tipo de nuvem mais barato, pois os custos de hardware, aplicativos e largura de banda são cobertos pelo provedor. A empresa paga somente pela capacidade utilizada. [...] Ela também é útil para quem tem pressa em utilizar recursos virtualizados, por tratar-se de uma nuvem que já está pronta.” Fonte: RUSSO, B. Nuvem pública, privada ou híbrida? Entenda as diferenças. 2017. Disponível em: <https://computerworld.com.br/2017/06/14/nuvem-publica-privada-ou-hibrida-entendadiferencas/>. Acesso em: 04 ago. 2019.  Considerando essas informações e o conteúdo estudado sobre os modelos de implantação em nuvem, pode-se afirmar que o trecho apresentado se refere a uma das vantagens do uso da nuvem pública, que está relacionada: ",
    "resposta": "ao preço. "
  },
  {
    "pergunta": "Em cada um desses usos, o desenvolvedor pode ainda usar ferramentas comuns e as melhores práticas, mas tendo um ambiente separado e seguro. Com a PaaS, as empresas também podem combinar os recursos e os dados locais para integrações personalizadas que atendem a uma variedade de serviços da web.” Fonte: INTEL. O que é PaaS? Disponível em: <https://www.intel.com.br/content/dam/www/public/lar/br/pt/documents/articles/10217909-hybrid-cloud-paas-whitepaper-x1a-1-por.pdf>. Acesso em: 21/07/2019.  Através das informações abordadas no texto e baseando-se no conteúdo estudado, é possível afirmar que, em relação aos dispositivos Web, cabe à PaaS: ",
    "resposta": "praticar o seu comando para viabilizar a apresentação dos resultados, independentemente da modalidade de dispositivo. "
  },
  {
    "pergunta": "Enquanto as empresas estão aproveitando os serviços de PaaS para algumas cargas de trabalho, elas também estão instalando software licenciado em instâncias da nuvem, com frequência. Essas licenças podem ser cobertas por acordos empresariais existentes ou podem representar novas licenças que precisam ser adquiridas. “. Fonte: WEINS, K. Licenciamento de software: o ponto cego nos custos da nuvem pública. 2018.  ",
    "resposta": "a transferência de arquivos, quando realizada de forma extensiva, precisa de versões compatíveis do software. "
  },
  {
    "pergunta": "Nuvem privada refere-se aos serviços de computação em nuvem oferecidos pela Internet ou por uma rede interna privada somente a usuários selecionados e não ao público geral. Também chamada de nuvem interna ou corporativa, a computação em nuvem privada proporciona às empresas muitos dos benefícios de uma nuvem pública.” Fonte: MICROSOFT AZURE. O que é nuvem privada?  ",
    "resposta": "pelo fato de o cliente possuir controle de como as aplicações serão inseridas na nuvem. "
  },
  {
    "pergunta": "O Amazon Elastic Compute Cloud (Amazon EC2) é um web service que disponibiliza capacidade computacional segura e redimensionável na nuvem. Ele foi projetado para facilitar a computação em nuvem na escala da web para os desenvolvedores.” Fonte: AWS. Amazon EC2: Capacidade computacional segura e redimensionável na nuvem. Lance aplicativos quando necessário, sem compromissos antecipados.  ",
    "resposta": "possibilitar aos usuários escalonar a capacidade positiva ou negativa, de acordo com as alterações. "
  },
  {
    "pergunta": "O API XML é destinado aos desenvolvedores de software. Ele pressupõe que você esteja familiarizado com serviços e programação da web e que se sinta à vontade para criar aplicativos que operem por meio de solicitações.” Fonte: GOOGLE CLOUD. XML API overview. Disponível em: <https://cloud.google.com/storage/docs/xml-api/overview?hl=pt-br>. Acesso em: 04 ago. 2019. (Adaptado).   Considerando essas informações e o conteúdo estudado sobre processos de implementação, podese afirmar que APIs são: ",
    "resposta": "aplicações em que o Cloud Storage pode ser executado utilizando moldes REST. "
  },
  {
    "pergunta": "O armazenamento na nuvem é um modelo de computação que armazena dados na Internet por meio de um provedor de computação na nuvem, que gerencia e opera o armazenamento físico de dados como serviço”. Fonte: AWS. Armazenamento em Nuvem. Disponível em <https://aws.amazon.com/pt/what-is-cloud-storage/>. Acesso em: 04 ago. 2019.  O trecho apresentado trata da definição de armazenamento na nuvem. Considerando essas informações e o conteúdo estudado sobre hospedagem de projetos na nuvem, pode-se afirmar que uma das principais vantagens da hospedagem em nuvem é: ",
    "resposta": "diminuir custos e atingir um nível mais alto de escalabilidade e mobilidade dentro de uma empresa. "
  },
  {
    "pergunta": "O AWS Outposts leva serviços, infraestrutura e modelos operacionais nativos da AWS a praticamente qualquer datacenter, espaço de co-location ou instalações locais. Você pode usar as mesmas API’s, as mesmas ferramentas, o mesmo hardware e a mesma funcionalidade local e na nuvem para fornecer uma experiência híbrida verdadeiramente consistente”. Fonte: AWS. AWS Outposts.  ",
    "resposta": "configuração, conexão, lançamento e construção. "
  },
  {
    "pergunta": "O IoT Edge Connect, um novo produto da linha de soluções Edge Cloud, enfrenta esses desafios oferecendo uma estrutura segura. Os dispositivos e aplicativos de IoT restritos a recursos que usam o MQTT como sistema de mensagens podem enviar ou publicar informações, sobre um determinado tópico, para um servidor que funciona como um intermediário de mensagens MQTT.” Fonte: ONAG, G. Akamai extends reach towards IoT devices. 2019. Disponível em: <https://futureiot.tech/akamaiextends-reach-towards-iot-devices/>. Acesso em: 04 ago 2019.  O trecho apresentado trata da importância do MQTT como intermediário de mensagens para serviços na nuvem. ",
    "resposta": "ser uma categoria backend que se interliga com aplicações permitidas pelo Spring Cloud Connectors. "
  },
  {
    "pergunta": "O mercado mundial de soluções de storage corporativo movimentou US$ 13,6 bilhões no último quadrimestre medido, no fim de 2017. O resultado representa uma alta de 13,7% em relação ao mesmo período do ano anterior, segundo relatório da IDC.” Fonte: EXAME. Players brasileiros se destacam em mercado global de US$ 13,6 bilhões. 2018. ",
    "resposta": "um modelo de arquivamento de documentos que permite a sincronização de dados com outros dispositivos, através da internet. "
  },
  {
    "pergunta": "O modelo de aplicação multinancy ou multiinquilino aumenta o número de inquilinos por aplicativo, reduzindo a necessidade de gerenciamento e custo do servidor por inquilino.”  Fonte: VERAS, Manoel. Cloud Computing: Nova Arquitetura de TI. Rio de Janeiro: Brasport, 2012. p. 47.   O trecho apresentado aborda a economia de escala que é gerada ao se implantar a Arquitetura Multinancy na computação em Nuvem. Considerando essas informações e o conteúdo estudado sobre o tema, é possível afirmar que a arquitetura multinancy (multiinquilno) gera esse benefício, entre outros aspectos, por: ",
    "resposta": "compartilhar, na infraestrutura, um conjunto de informações e dados extraídos de uma variedade de clientes. "
  },
  {
    "pergunta": "O modelo PaaS visa permitir que os desenvolvedores criem seus próprios aplicativos em cima da plataforma. Assim é mais extensível que o modelo SaaS, à custa de funcionalidades disponibilizadas aos clientes. As capacidades de segurança são menos completas, mas há flexibilidade para adicionar uma camada de segurança extra.”  Fonte: VERAS, Manoel. Cloud Computing: Nova Arquitetura da Ti. Rio de Janeiro: Brasport. 2012. p. 50.  Considerando essas informações e o conteúdo estudado, é possível afirmar que, além dos procedimentos de segurança, cabe ao PaaS: ",
    "resposta": "abortar as possíveis ameaças que surjam no sistema. "
  },
  {
    "pergunta": "O Oracle Cloud Infrastructure (OCI) combina os benefícios da nuvem pública (sob demanda, autoatendimento, escalabilidade, pague pelo uso) com os que são normalmente associados a ambientes locais (governança, previsibilidade, controle) em uma única oferta.” Fonte: ORACLE. Novos SLAs de IaaS, Líderes do Setor, trazem mais Tranquilidade para Você. Disponível em: <https://www.oracle.com/br/cloud/iaas.html>. Acesso em: 21/07/2019.  O trecho apresentado aborda as características de uma modalidade IaaS e suas funcionalidades. A partir dessas informações e do conteúdo estudado, é possível afirmar que uma infraestrutura, em linhas gerais, pode ser definida como: ",
    "resposta": "uma série de serviços ou elementos essenciais para que uma determinada empresa ou atividade possa ser executada. "
  },
  {
    "pergunta": "O projeto Opensatck foi criado com o objetivo audacioso de ser a escolha onipresente de software para a criação de infraestruturas em nuvem. Há pouco mais de um ano, passou de uma ideia para começar a colaborar para ser o projeto mais discutido em código aberto.” Fonte: PEPPLE, Ken. Deploying OpenStack. Sebastopol: O’REILLY. 2011. p.1.  A partir dessas informações e do conteúdo estudado sobre o tema, é possível afirmar que o projeto OpenSatck é empregado por um serviço disponibilizado pelo RackSpace, denominado: ",
    "resposta": "Cloud Files. "
  },
  {
    "pergunta": "O recurso funciona de forma simples, sendo necessários poucos cliques para ter de volta fotos, vídeos, documentos, áudios e demais itens deletados por engano. Compatível com Windows e Mac OS, o software é prático para usar e oferece ferramentas de buscas completas.” Fonte: MANNARA, Bárbara. Disk Drill recupera arquivos deletados no PC de forma simples. Disponível em: <https://www.techtudo.com.br/tudo-sobre/disk-drill.html>. Acesso em: 13/08/2019.  O trecho apresentado aborda a definição do Disk Drill. Considerando essas informações e o conteúdo estudado, é possível afirmar que Disk Drill é habilitado para: ",
    "resposta": "reestabelecer partições excluídas. "
  },
  {
    "pergunta": "O S3 possui um painel gráfico para gerenciamento de serviço e também uma API que facilita muito a integração com os outros sistemas. Se você não precisa integrar com nenhum sistema e vai subir manualmente os arquivos pode utilizar o painel gráfico. Se precisar integrar com algum sistema, pode usar a API, que está disponível para diversas linguagens de programação.”  Fonte: ANTUNES, Jonathan. Amazon AWS: Descomplicando a Computação da Nuvem. São Paulo. Casa do Código. 2016. p. 11.  O trecho apresentado trata das características principais do modelo Amazon S3. Considerando essas informações e o conteúdo estudado sobre o tema, é possível afirmar que a Amazon S3 pode ser definida como: ",
    "resposta": "um serviço cujo objetivo é armazenar dados na nuvem. "
  },
  {
    "pergunta": "O serviço de infraestrutura de nível empresarial da Oracle fornece um ambiente de processamento virtual ágil e provisionado que permite migrar cargas de trabalho e executá-las em escala com desempenho, controle e visibilidade previsíveis e consistentes.” Fonte: ORACLE. Novos SLAs de IaaS, Líderes do Setor, Trazem mais Tranquilidade para Você. Disponível em: <https://www.oracle.com/br/cloud/iaas.html>. Acesso em: 21/07/2019.  Considerando essas informações e o conteúdo estudado, analise as ações para formular estratégias de negócios e associe-as com suas respectivas características:  1) Teste e desenvolvimento. 2) Hospedagem de sites. 3) Armazenamento, backup e recuperação. 4) Aplicativos Web. 5) Computação de alto desempenho. 6) Análise de Big Data.  ( ) Uma alternativa viável é executar os sites utilizando o IaaS, que apresenta custos de implantação mais reduzidos.  ( ) É importante para cuidar de demandas inesperadas e armazenamentos em elevação contínua.  ( ) Os espaços destinados aos experimentos e criação, que podem ser instalados ou desmontados pelas equipes.  ( ) Se caracterizam por estar inseridos em supercomputadores, por exemplo, ajudando a solucionar situações mais complexas.  ( ) Cabe ao IaaS disponibilizar a infraestrutura necessária para esses aplicativos, onde as empresas possam inseri-los de maneira mais rápida.   ( ) Está relacionado a um conjunto de dados em grande escala, que apresentavam alguns padrões.  Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "2, 3, 1, 5, 4, 6. "
  },
  {
    "pergunta": "O SLA é uma das garantias que a empresa tem de que o serviço contratado será executado conforme as expectativas do empreendimento. Ele facilita a delimitação de limites, regras e proteções a ambas as partes.” Fonte: QI NETWORK. Você sabe o que é SLA e para que serve? Disponível em: <https://www.qinetwork.com.br/voce-sabe-o-que-e-sla-e-para-queserve/>. Acesso em: 17/07/2019.  O trecho apresentado trata da Importância do SLA (Service Level Agreements) nos contratos impostos à Computação em Nuvem. Assim, considerando as informações apresentadas e os conteúdos estudados sobre o tema, podemos afirmar que o SLA (Service Level Agreements) se caracteriza por: ",
    "resposta": "detalhar, de maneira formal, os atributos necessários para um serviço proposto, como a entrega e a cobrança dos serviços a serem oferecidos. "
  },
  {
    "pergunta": "O uso da Criptografia não é recente e ao longo dos tempos teve larga aplicação estratégica e militar. A necessidade de enviar mensagens às tropas, que não pudessem ser compreendidas pelo inimigo, caso o mensageiro caísse em suas mãos.”  Fonte: MARCACINI, Augusto Tavares Rosa. Direito e Informática: Uma abordagem Jurídica sobre a criptografia. São Paulo: Editora Forense, 2010. p. 19.   O trecho apresentado aborda o uso da criptografia ao longo dos tempos. A partir dessas informações e do conteúdo estudado, pode-se afirmar que a criptografia se caracteriza por: ",
    "resposta": "transformar o texto aberto em cifrado por meio de algoritmos parametrizados por chave. "
  },
  {
    "pergunta": " Os benefícios associados ao uso de Cloud Servers já são amplamente conhecidos. Equipes de TI usam cada vez mais os servidores virtuais para obter agilidade e gerenciamento. Os gestores, por sua vez, veem na tecnologia uma forma de aumentar a produtividade e substituir investimentos em hardware pela infraestrutura como serviço.” Fonte: DINO. CentralServer anuncia serviço de cloud server com conceito inovador. Disponível em: <https://exame.abril.com.br/negocios/dino/centralserveranuncia-servico-de-cloud-server-com-conceito-inovador-dino89094819131/>. Acesso em: 11/04/2019.  O trecho apresentado aborda a importância do Cloud Severs dentro da área da Tecnologia da Informação. A partir dessas informações e do conteúdo estudado sobre o tema, podemos considerar que a Cloud Severs podem ser definidas como: ",
    "resposta": "máquinas virtuais que operam em conjunto com o servidor. "
  },
  {
    "pergunta": " Os desenvolvedores devem fornecer recursos para o desenvolvimento de seus aplicativos, mas eles têm uma compreensão limitada do que realmente precisam. Como resultado, eles geralmente superestimam, levando a uma utilização ineficiente de recursos e ao aumento dos custos.” Fonte: INTEL. O que é PaaS? Disponível em: <https://www.intel.com.br/content/dam/www/public/lar/br/pt/documents/articles10217909-hybrid-cloud-paas-whitepaper-x1a-1-por.pdf>. Acesso em: 21/07/2019.  O trecho apresentado aborda um dos desafios do desenvolvimento na nuvem em relação ao uso ineficiente dos recursos. A partir dessas informações e do conteúdo estudado, podemos considerar que o trecho apresentado se refere à vantagem do uso do PaaS, por conta do: ",
    "resposta": "menor nível de investimento no início da sua execução. "
  },
  {
    "pergunta": " Os equipamentos que eram utilizados estavam se depreciando e a renovação desse parque proprietário teria um custo de investimento maior do que o previsto para realizar uma migração completa e operar na nuvem. Ao adotar a nuvem da AWS, o Banco pode evoluir as plataformas para algo mais inovador e iniciar a aplicação da cultura de DevOps com maior facilidade.” Fonte: BAGUETE. Banco Fibra migra aplicações para AWS. Disponível em: <https://www.baguete.com.br/noticias/10/07/2019/banco-fibra-migra-aplicacoes-para-aws>. Acesso em: 11/07/2019.  O trecho apresentado fala da importância das arquiteturas AWS na execução dos serviços financeiros. Através das informações abordadas no texto e baseando-se no conteúdo estudado sobre o tema, é possível afirmar que o motivo pelo qual as organizações buscam a arquitetura Amazon (AWS) é: ",
    "resposta": "a possibilidade de acesso aos serviços de infraestrutura, via on demand. "
  },
  {
    "pergunta": "Outra mudança também está em curso à medida que a nuvem avança em sua adolescência: em vez de apenas fornecer servidores e armazenamento temporários mais baratos, a nuvem oferecerá cada vez mais serviços inovadores de desenvolvimento para aplicativos corporativos, diz Dave Bartoletti, analista da Forrester Research.” Fonte: BOULTON, C. Cloud Computing: 5 Tendências para 2019. 2018. Disponível em: <https://cio.com.br/cloud-computing-5-tendencias-para-2019/>. Acesso em: 04 ago. 2019.  Considerando essas informações e o conteúdo estudado sobre a nuvem corporativa, pode-se afirmar que uma das tendências no mercado de nuvem pública é: ",
    "resposta": "exibir infraestrutura e plataforma dominadas pela Amazon Web Services, pelo Microsoft Azure e pelo Google Cloud Platform. "
  },
  {
    "pergunta": " Por outras palavras, multicloud pode ser vista como uma estratégia de adoção de serviços de cloud computing por meio da qual a empresa escolhe implementar soluções de computação em nuvem de diferentes prestadores de serviço. O objetivo da multicloud é criar, portanto, uma plataforma com mais serviços, disponibilidade e flexibilidade.” Fonte: ESTADÃO. Multicloud potencializa recursos de computação. Disponível em: <http://patrocinados.estadao.com.br/mundodigital/multicloudpotencializa-recursos-de-computacao/>. Acesso em: 13/08/2019.  O trecho aborda as características Multicloud como um meio de implementar soluções na nuvem. Assim, considerando as informações apresentadas e os conteúdos estudados, analise as etapas que devem ser realizadas para a implementação de um sistema na nuvem e associe-as com suas respectivas características:  1) Prioridades para a nuvem.  2) Nuvem adequada às suas demandas. 3) Provedores ideais para o seu negócio. 4) Ambiente adequado os dados e sistemas. 5) Implementação de uma migração monitorada e controlada.  ( ) Gerir os riscos e dados ao longo do processo, lembrando que essa mobilidade é executada por smartphones e tablet’s.  ( ) O cliente pode adotar dados ou sistemas que são dispensáveis para o negócio, portanto, é importante perceber quando o ambiente está propenso para receber a estrutura do seu negócio.  ( )  ",
    "resposta": "5, 4, 3, 2, 1. "
  },
  {
    "pergunta": "Ruby é uma linguagem dinâmica, com conceitos de metaprogramação, orientação a objetos com uma alternativa limpa para polimorfismo, com maxins, blocos e fechamentos. Criada para ser simples e elegante, porém altamente expressiva e intuitiva.” Fonte: AKITA, Fábio. Repensando a Web com Rails. Rio de Janeiro: Brasport, 2006. p. 14.  O trecho apresentado trata do conceito de Ruby associado à utilização da metaprogramação. Assim, considerando as informações apresentadas e os conteúdos estudados, podemos afirmar que a metaprogramação tem como objetivo: ",
    "resposta": "aumentar o ritmo de produtividade apresentada pelo Ruby, porém, o seu valor deve ser medido de forma relativa. "
  },
  {
    "pergunta": "Segundo o presidente da Associação Brasileira das Empresas de Infraestrutura de Hospedagem na Internet (Abrahosting), Vitor Neto, a computação na nuvem é a versão moderna do antigo data center: ‘O cloud veio para fazer uma evolução desse serviço de data center, que se transformou para deixar o serviço mais fácil para o cliente, além de mais barato’.” Fonte: MUNARO, J. Mercado de computação nas nuvens cresce no Brasil. 2017. Disponível em: http://g1.globo.com/economia/pme/pequenasempresas-grandes-negocios/noticia/2017/07/mercado-de-computacao-nas-nuvens-cresce-no-brasil.html. Acesso em: 04 ago. 2019. (Adaptado).  Considerando essas informações e o conteúdo estudado sobre a computação em nuvem, pode-se afirmar que o projeto em nuvem pode ser definido como: ",
    "resposta": "um serviço que permite aos seus usuários armazenar e dividir uma série de documentos, por meio de uma conexão com a internet. "
  },
  {
    "pergunta": "Um dos itens mais importantes na contratação da nuvem pública é o acordo de qualidade de serviço (SLA). Muitas empresas concentram mais em disponibilidade. Outras, na qualidade do serviço, tão importante quanto. Afinal, falhas e tempo de inatividade têm enorme impacto na continuidade do negócio e podem afetar negativamente a lealdade do cliente.” Fonte: ARMANDPOUR, Tim Três pegadinhas dos SLAs de Cloud que sua empresa precisa evitar. Disponível em: <https://cio.com.br/tres-pegadinhas-dos-slas-de-cloud-computing/ >. Acesso em: 21/07/2019.   A partir dessas informações e do conteúdo estudado, é possível definir o SLA como: ",
    "resposta": "uma série de normas definidas em contrato, no qual são estabelecidas as regras de negociação, monitoramento e execução. "
  },
  {
    "pergunta": "Um dos serviços mais conhecidos do PaaS é o Application Engine do Google, que cria e implanta aplicações Web para empresas. O Applicattion Engine da Google é fácil de construir, fácil manter e fácil de dimensionar, conforme cresce as necessidades de aplicativos baseados na Web da empresa.”  Fonte: BALTZAN, Paige. Tecnologia Orientada para Gestão. Nova York: McGrawHill, 2016. p. 465.   O trecho apresentado aborda um dos serviços oferecidos pela PaaS. Considerando essas informações e o conteúdo estudado, é possível afirmar que uma das principais características do PaaS é: ",
    "resposta": "apresentar uma série de benefícios ao expor o acesso imediato e simplificado ao desenvolvimento de aplicativos e ambientes de implementação na nuvem. "
  },
  {
    "pergunta": "Um projeto de armazenamento em nuvem bem executado é um ganho em segurança e garante à empresa um domínio maior sobre como suas informações estão sendo acessadas e utilizadas. Além disso, o armazenamento em nuvem contribui para uma empresa enxuta e com mais capacidade de inovação.” FONTE: VEXIA. Por que ter um projeto de armazenamento em nuvem corporativo? Disponível em: <https://vexia.com.br/pt/armazenamento-em-nuvem-corporativo/>. Acesso em: 04 ago. 2019.  Considerando essas informações e o conteúdo estudado sobre hospedagem de projetos na nuvem, pode-se afirmar que os projetos corporativos na nuvem se caracterizam por: ",
    "resposta": "manter uma infraestrutura flexível e escalável, em que a empresa consegue se adaptar às possíveis mudanças para impedir uma redução de desempenho e atrasos na entrega do serviço. "
  },
  {
    "pergunta": " Vivemos um período de crise generalizada de confiança, que extrapola os eventos na internet. Acima de regras morais e éticas, arcabouço regulatório e sistemas de punição, para funcionar de maneira sadia a sociedade precisa de um mínimo de confiança entre seus agentes – instituições, governos e cidadãos. As facilidades da tecnologia e do meio digital só exacerbam o atual cenário.”  e do conteúdo estudado podemos considerar que a confiança dentro da Computação em Nuvem é: ",
    "resposta": "o usuário obter um provedor com a capacidade de atender os serviços solicitados com alto nível de eficácia e sem falhas. "
  },
  {
    "pergunta": "A UML é uma linguagem de notação onde expressa através de diagramas as informações que deseja expor, facilitando a explicação e documentação das visões arquiteturais e estruturais de um software.”Fonte: GUEDES, G. T. UML 2 – Uma Abordagem Prática. São Paulo: NOVATEC, 2018.Considerando as informações apresentadas e o conteúdo estudado sobre as visões arquiteturais, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s).I. ( ) A UML é uma linguagem baseada nos conceitos da programação estruturada.II. ( ) A UML possui como elemento base de todos os seus diagramas o objeto.III. ( ) O diagrama de classes pertence ao conjunto UML da modelagem estrutural.IV. ( ) O diagrama de estados visa demonstrar o fluxo de informação que é executado em cenários específicos.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "F, V, V, F. "
  },
  {
    "pergunta": "Na fase de avaliação arquitetural, temos a importante tarefa de realizar a validação e a análise da documentação arquitetural, através de métodos e procedimentos que já possuam sua eficácia comprovada.Considerando essas informações e o conteúdo estudado sobre modelagem complexa, analise as asserções a seguir e a relação proposta entre elas.I. Os requisitos de qualidade serão, basicamente, os direcionadores das atividades de avaliação arquiteturais.Porque:II. A metodologia ATAM utiliza as decisões e definições tanto técnicas quanto gerenciais.A seguir, assinale a alternativa correta: ",
    "resposta": "As asserções I e II são proposições verdadeiras, mas a II não é uma justificativa correta da I. "
  },
  {
    "pergunta": "No contexto da modelagem arquitetural, é importante aborda os aspectos funcionais e não funcionais e como eles podem influenciar na modelagem arquitetural e, futuramente, na própria arquitetura.Considerando a afirmação apresentada e o conteúdo estudado sobre modelagem arquitetural, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s):I. ( ) Os aspectos funcionais tendem a ser qualitativos e subjetivos.II. ( ) Os aspectos não funcionais estão relacionados a como o sistema fará suas ações.III. ( ) Os aspectos não funcionais, normalmente, são mais concretos e mais fáceis de modelar.IV. ( ) Os aspectos funcionais são mais concretos, facilitando a modelagem. Agora assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "F, V, F, V. "
  },
  {
    "pergunta": "No contexto de análise arquitetural e de suas várias possibilidades, devemos sempre nos atentar aos tipos e técnicas que podem ser utilizadas para auxiliar na melhora da utilização das informações e no seu entendimento dentro do contexto arquitetural. Podemos, assim, classificá-la em 3 tipos diferentes: Análise Estática, Análise Dinâmica e Análise de Cenários.Considerando as informações apresentadas e o conteúdo estudado sobre análise arquitetural e suas técnicas, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s).I. (  ) Análise estática define a descoberta de propriedades através dos modelos arquiteturais disponíveis, sem a necessidade de sua execução.II. (  ) Na análise dinâmica, o modelo utilizado dispensa a necessidade de ser simulável.III. (  ) Em análise de cenários, a avaliação é realizada através de cenários, ou casos de uso específicos que representam os pontos principais e críticos do sistema.IV. (  ) A análise estática também precisa ser simulável.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "V, F, V, F. "
  },
  {
    "pergunta": "No contexto de análise arquitetural, além das metas e do escopo, temos os aspectos arquiteturais que auxiliarão no refinamento e na melhora da análise arquitetural, proporcionando características importantes que auxiliarão no entendimento da estrutura da arquitetura.Considerando as informações apresentadas e o conteúdo estudado sobre a análise arquitetural e dos aspectos arquiteturais, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s).I. (  ) As características funcionais são um exemplo de características que podemos encontrar dentro dos aspectos arquiteturais.II. (  ) As características comportamentais estão presentes nos aspectos arquiteturais e auxiliam no entendimento do comportamento do sistema.III. (  ) As características de interação estão presentes nos aspectos arquiteturais e permeiam as informações em relação aos conectores utilizados na arquitetura.IV. (  ) As características estruturais podem ser desconsideradas como parte dos aspectos arquiteturais e consideradas como parte do escopo arquitetural.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "F, V, V, F. "
  },
  {
    "pergunta": "No contexto de modelagem arquitetural, é muito importante que o arquiteto tenha opções de notação que permitam a realização da modelagem de diferentes aspectos arquiteturais e estruturas. Essas estruturas notacionais permitirão que o arquiteto e as partes envolvidas tenham um melhor entendimento e visão do que está sendo feito. Considerando as informações apresentadas e o conteúdo estudado, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s).I. (  ) A UML é um exemplo de técnica de modelagem genérica.II. (  ) A UML é considerada uma ADL.III. (  ) Wright é um exemplo de ADLIV. (  ) A linguagem natural é uma forma de ADL.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "V, F, V, F. "
  },
  {
    "pergunta": "No processo de análise arquitetural, assim que temos mapeados os possíveis tipos de análise, os níveis de formalização e níveis de automação, podemos identificar e selecionar as técnicas que serão aplicadas na análise arquitetural, que podem ser: Baseadas em Inspeção e Revisão, Baseada em Modelos e Baseadas em Simulação.Considerando a informação apresentada e o conteúdo estudado sobre análise arquitetural, analise os requisitos não funcionais dispostos a seguir associando-os às suas definições:1) Técnica Baseada em Inspeção e Revisão.2) Técnica Baseada em Modelos3) Técnica Baseada em Simulação(  ) Esse tipo de técnica está relacionado ao foco em apenas um aspecto dentro da análise, como a ausência de deadlock ou forma sintática.(  ) Nesse tipo de técnica, é necessário que o modelo arquitetural disponível no projeto corrente (ou em parte deste projeto) seja dinâmico e tenha a capacidade de ser executado, a fim de que se possa utilizar o seu resultado para a análise arquitetural.(  ) Esse tipo de técnica utiliza a visão de diferentes stakeholders, de forma que se tenha uma variedade nas propriedades arquiteturais, com o intuito de melhorar a sua efetividade analítica.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "2, 3, 1. "
  },
  {
    "pergunta": "O arquiteto de software vem se tornando um player cada vez mais importante no ciclo de desenvolvimento de software nas empresas. Dentre as suas atividades, é necessário que ele consiga identificar, junto ao usuário, vários tipos de requisitos para a confecção do design da arquitetura.Considerando essas informações e o conteúdo estudado sobre o papel do arquiteto de software, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s):I. ( ) O arquiteto deve se preocupar com os requisitos não funcionais e desconsiderar outros fatores.II. ( ) O arquiteto de software deve se preocupar apenas com os requisitos não funcionais e de usuário.III. ( ) O ",
    "resposta": "F, F, V, V. "
  },
  {
    "pergunta": "O conceito de performance é um dos mais importantes e normalmente está presente como requisito obrigatório em todos os softwares desenvolvidos. Sua principal característica é garantir que o software tenha um bom tempo de resposta/processamento nas funcionalidades do sistema.Considerando essas informações e o conteúdo estudado sobre arquitetura de software e suas características, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s).I. (  ) Performance é um requisito difícil de medir, pois há uma ausência de ferramentas que auxiliam nesse cenário.II. (  ) Uma característica que é usada para medir a performance é o tempo de resposta das funcionalidades.III. (  ) Throughput é uma característica usada para auxiliar a identificar problemas de performance.IV. (  ) Performance é um requisito não funcional que permite a identificação de falhas no desempenho da aplicação.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "F, V, V, V. "
  },
  {
    "pergunta": "O FEAF apresenta quatro pilares importantes para suportar a sua estrutura e que, além disso, promovem a organização e a estruturação do framework, a fim de que ele possa ser aplicado corretamente em um projeto.Considerando essas informações e o conteúdo estudado, analise os pilares a seguir e associe-os a seus respectivos conceitos:1) Service Delivery.2) Functional Integration.3) Resource Optimization.4) Authoritative Reference.(  ) Significa interoperabilidade entre programas, sistemas e serviços, o que requer metacontexto e padrões para ser bem-sucedido.(  ) Fornece uma visão integrada e consistente de objetivos estratégicos, missão e serviços de suporte, dados e tecnologias de capacitação em toda a organização, incluindo programas, serviços e sistemas.(  ) Como custodiantes de fundos públicos, as organizações do setor federal têm a responsabilidade especial de otimizar o uso de recursos.(  )  ",
    "resposta": "2, 4, 3, 1. "
  },
  {
    "pergunta": "O framework arquitetural DoDAF foi criado pelo Departamento de Defesa americano e possui uma característica muito interessante, que é o suporte a desafios complexos relacionados a integração e interoperabilidade de grandes sistemas de software. Para atender esta característica, este framework é composto de várias visualizações que suportam a sua utilização.Considerando essas informações e o conteúdo estudado sobre framework arquitetural, analise as afirmações a seguir.I. A visualização operacional é um tipo de visão disponível no DoDAF que descreve os aspectos e a estrutura dos componentes que constituem o ambiente operacional, relacionamentos e dependências.II. A visualização contextualizada é uma visão presente no DoDAF, que descreve a estrutura interna e o comportamento dos componentes que irão suportar as funções.III. A visualização de padrões técnicos descreve os padrões e regras que governam a organização.IV. Dentro do contexto DoDAF há um tipo de visualização que unifica todas as visualizações chamada AV, ou Todas as Visualizações.Está correto apenas o que se afirma em: ",
    "resposta": "I, III e IV. "
  },
  {
    "pergunta": "O framework arquitetural FEAF foi criado pelo Governo Federal e sua criação tem relação com o fornecimento de uma abordagem comum para a integração estratégica de negócios e gerenciamento tecnológico, provendo domínios de sub arquitetura para auxiliar na sua utilização e aplicação.Considerando essas informações e o conteúdo estudado sobre o FEAF, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s):I. (  ) O contexto é um domínio de sub arquitetura do FEAF.II. (  ) A infraestrutura é um domínio de sub arquitetura pertencente ao FEAF.III. (  ) A segurança é um domínio de sub arquitetura presente no FEAF.IV. (  )  ",
    "resposta": "F, V, V, F. "
  },
  {
    "pergunta": "O modelo arquitetural SOA normalmente utiliza ferramentas para auxiliar na sustentação e implantação de suas regras e definições. Uma das ferramentas mais importantes e mais utilizadas nesse tipo de arquitetura é o ESB (Enterprise Service Bus) que tem, entre suas capacidades, o importante papel de realizar a integração entre diversas partes do sistema.Considerando essas informações e o conteúdo estudado sobre os padrões arquiteturais, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s).I. (  ) ESB’s têm a capacidade de enriquecer as informações e agregar mais valor funcional.II. (  ) ESB’s permitem a integração com aplicações e componentes externos.III. (  ) O sentido do uso de um ESB está diretamente associado ao uso de uma arquitetura SOA.IV. (  ) É possível implementar o padrão SOA sem a utilização de um ESB.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "V, V, F, V. "
  },
  {
    "pergunta": "O padrão arquitetural Micro Serviços traz a ideia de se construir uma coleção de serviços de baixo acoplamento e granulagem fina, com a finalidade de promover a flexibilização de sua estrutura e o aumento da modularidade sistêmica.Considerando as informações apresentadas e o conteúdo estudado, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s).I. (  ) Uma vantagem de se utilizar micro serviços é o seu aumento nos desafios de soluções de problemas que surgem com essa arquitetura.II. (  ) Uma vantagem ao se adotar a arquitetura de micro-serviços é a interdependência de tecnologias.III. (  ) Uma desvantagem de se adotar a arquitetura de micro-serviços é a maior dificuldade de se manter a segurança transacional.IV. (  ) Uma desvantagem de se adotar a arquitetura de micro-serviços é a capacidade de se desenvolver e implantar os serviços em paralelo.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "F, V, V, F. "
  },
  {
    "pergunta": "O processo de avaliação arquitetural é de extrema importância para o ciclo de desenvolvimento de um software, pois nesse ponto são realizadas as validações e análise dos documentos arquiteturais através de procedimentos e métodos sistêmicos. Como fruto desse tipo de processo, temos à disposição algumas metodologias que nos auxiliam na hora de avaliar uma arquitetura.Considerando essas informações e o conteúdo estudado sobre análise arquitetural, analise as afirmativas a seguir.I. ATAM é uma metodologia que pode ser utilizada para realizar a avaliação arquitetural.II. TOGAF é uma metodologia que pode ser utilizada para realizar a avaliação arquitetural.III. ASAAM é uma metodologia que pode ser utilizada para realizar a avaliação arquitetural.IV. RUP é uma metodologia que pode ser utilizada para realizar avaliação arquitetural.Está correto apenas o que se afirma em: ",
    "resposta": "I e III. "
  },
  {
    "pergunta": "O processo unificado é uma metodologia importante, que surgiu para auxiliar na criação de uma forma de se desenvolver projetos que seja mais organizada e possua definições e fases que sejam claras e bem divididas.Considerando essas informações e o conteúdo estudado sobre implementação arquitetural, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s). I. (  ) A elaboração é uma fase pertencente ao processo unificado.II. (  ) O processo unificado é uma metodologia baseada na orientação por eventos.III. (  ) A transição é uma fase pertencente ao processo unificado.IV. (  ) O processo unificado dispensa características que sejam interativas e incrementais.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "V, F, V, F. "
  },
  {
    "pergunta": "O sistema de controle de versão permite ao time de implementação ter um controle maior sobre os ativos físicos do software, como código fonte, documentos, resources, entre outros. Para que esse controle seja simples e padronizado, todo sistema de controle de versão possui uma estrutura de armazenamento e processos interativos sobre os artefatos.Considerando essas informações e o conteúdo estudado sobre implementação arquitetural, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s). I. (  ) O comando de update é utilizado para confirmar as alterações realizadas localmente.II. (  ) Como padrão, para confirmar as alterações de um artefato o sistema de controle de versão utiliza o comando de commit.III. (  ) A área de armazenamento local é a parte do sistema de controle de versão na qual o profissional irá armazenar suas alterações.IV. (  ) O repositório é o local onde os arquivos temporários referentes às alterações realizadas são armazenados.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "F, V, V, F. "
  },
  {
    "pergunta": "O TOGAF é um framework arquitetural que foi criado pelo Open Group e é um dos frameworks mais utilizados nos projetos de software, atualmente. Para que ele pudesse ter toda esta adesão, uma série de características positivas são providas por este framework.Considerando estas informações e o conteúdo estudado sobre TOGAF, analise as afirmativas a seguir.I. Um dos benefícios do TOGAF está na melhora considerável no entendimento do negócio ao qual a solução pertence.II. Um benefício inerente de se utilizar o TOGAF em um projeto é a capacidade de expor de forma mais clara os custos, benefícios e riscos do projeto.III. Um benefício inerente da utilização do TOGAF é a oportunidade de desenvolver componentes de software específicos e customizados para a solução proposta.IV. Um benefício de se utilizar o TOGAF é a capacidade de tornar o negócio mais dinâmico e ágil, aumentando a capacidade de absorção das mudanças. Está correto apenas o que se afirma em: ",
    "resposta": "I, II e IV. "
  },
  {
    "pergunta": "O TOGAF, como outros frameworks arquiteturais, teve o seu início utilizando outros frameworks ou estruturas arquiteturais que proveram o insumo necessário para a sua criação.Considerando essas informações e o conteúdo estudado sobre modelagem complexa, analise as asserções a seguir e a relação proposta entre elas:I. O TOGAF é um framework que possibilita realizar a organização do processo de desenvolvimento utilizando uma metodologia sistemática, que promove a redução de erros, a saúde do cronograma e do orçamento.Porque:II. O TOGAF tem como um de seus objetivos auxiliar na construção de arquiteturas corporativas, oferecendo uma estrutura de alto nível para o desenvolvimento de soluções de software.A seguir, assinale a alternativa correta: ",
    "resposta": "As asserções I e II são proposições verdadeiras, e a II é uma justificativa correta da I. "
  },
  {
    "pergunta": "Os conectores apresentam-se como um dos elementos mais importantes para a realização da interoperabilidade e integração entre os componentes de um projeto. O entendimento do seu funcionamento, suas classificações e os serviços disponibilizados por eles são fundamentais para a sua correta utilização. O conhecimento de quais tipos de classificação um conector pode fazer parte é fundamental para a sua correta utilização.Considerando a afirmação acima e o conteúdo estudado sobre conectores arquiteturais, analise as afirmativas a seguir e a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s):I. ( ) Conectores do tipo Data Access são responsáveis pela interação com a camada de visão.II. ( ) Conectores do tipo Linkage são utilizados para realizar a união de componente.III. ( ) Conectores do tipo Adaptor são utilizados para processar grandes volumes de dados.IV. ( ) Conectores do tipo Procedure Call são utilizados para a transferência de dados entre os componentes.Agora, assinale a alternativa que apresenta a sequência correta:  ",
    "resposta": "F, V, F, V. "
  },
  {
    "pergunta": "Os estilos arquiteturais são elementos de extrema importância na modelagem e análise de arquiteturas de software. O estilo, além de agrupar os conceitos arquiteturais e decisões críticas, auxilia na melhor visualização do contexto arquitetural sendo tratado. Uma das partes mais importantes do estilo arquitetural é a capacidade de se classificar as decisões capturadas.Considerando essas informações e o conteúdo estudado referente aos possíveis tipos de decisões, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s):I. ( ) Decisões por elementos genéricos é um tipo válido de classificação de decisões arquiteturais capturadas.II. ( ) Decisões por restrições comportamentais é um tipo válido de classificação de decisões arquiteturais capturadas.III. ( ) Decisões por restrição de interação é um tipo válido de classificação de decisões arquiteturais capturadas.IV. ( ) Decisões por restrições de usuário é um tipo válido de classificação de decisões arquiteturais capturadas.Agora assinale a alternativa correta: ",
    "resposta": "F, V, V, F. "
  },
  {
    "pergunta": "Os padrões de projetos, por serem muitos e possuírem perfis diferentes em sua estrutura, precisam ser classificados e separados de forma que os agrupamentos possam categorizar de forma adequada os tipos de padrões existentes.Considerando essas informações e o conteúdo estudado sobre implementação arquitetural e padrões de projetos, analise as classificações disponíveis a seguir e associe-as com suas respectivas características.1) Padrões de criação.2) Padrões estruturais.3) Padrões comportamentais.(  ) Preocupam-se com o modo como classes e objetos são compostos para formar estruturas maiores.(  ) Focam em encontrar a maneira como as atribuições e responsabilidades são associadas aos objetos e aos algoritmos.(  ) São padrões que permitem a abstração do modo como os objetos serão criados no sistema.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "2, 3, 1. "
  },
  {
    "pergunta": "Os projetos arquiteturais e suas estruturas estão sempre relacionados, de forma direta ou indireta, aos requisitos não funcionais e às influências no contexto do software que está sendo desenvolvido.Considerando essas informações e o conteúdo estudado sobre projeto arquitetural, analise as afirmativas a seguir sobre tipos de requisitos não funcionais e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s).I. (  ) A aplicação deve estar disponível 99% do tempo, 24 horas por dia, 7 dias por semana.II. (  ) A aplicação deve possuir um CRUD de clientes.III. (  ) A aplicação deve ter um tempo médio de resposta para requisições HTTP de 3 segundos.IV. (  ) A aplicação deve permitir a inserção de configurações específicas do sistema.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "V, F, V, F. "
  },
  {
    "pergunta": "Os requisitos não funcionais discutidos nos padrões de projeto são explicitamente representados, o que permite analisar e referenciar o papel que desempenham na estrutura de argumentação dos padrões de projetos.Considerando essas informações e o conteúdo estudado sobre projeto arquitetural, pode-se afirmar que o trecho apresentado faz referência, na análise da relação entre NFRs e design patterns, ao objetivo de: ",
    "resposta": "clarear o papel dos requisitos não funcionais nos padrões de desenho. "
  },
  {
    "pergunta": "Os requisitos não funcionais são importantes medidores de qualidade estrutural da arquitetura da solução proposta. Esses requisitos possuem várias definições relacionadas a desempenho, integração e outros, que ajudam o arquiteto de softwares a trilhar um caminho mais claro na definição estrutural de mesma. Baseando-se na informação apresentada e no conteúdo estudado sobre arquitetura de software e sua relação com os requisitos não funcionais, analise os requisitos não funcionais a seguir e associe-os às suas definições:1) Performance.2) Manutenibilidade.3) Usabilidade.4) Confiabilidade.( )  ",
    "resposta": "3, 1, 4, 2. "
  },
  {
    "pergunta": "Os requisitos não funcionais sempre estiveram presentes dentro do processo de desenvolvimento de software, ganhando força e complexidade com a evolução do tempo e das tecnologias e negócios envolvidos.Considerando eestas informações e o conteúdo estudado sobre projeto arquitetural, analise os requisitos não funcionais a seguir e associe-os às suas respectivas finalidades:1) Disponibilidade.2) Escalabilidade.3) Performance.(  ) O software deve ser projetado para dimensionar e reduzir dinamicamente com base na carga em tempo real no sistema.(  ) Com o constante aumento na velocidade da internet e na disponibilidade de largura de banda, há uma tendência geral de se esperar uma resposta rápida de aplicativos baseados na internet.(  ) O software tem que estar disponível (on-line), em primeiro lugar, para só então outros requisitos entrarem. ",
    "resposta": "2, 3, 1. "
  },
  {
    "pergunta": "Os sistemas de controle de versão estão presentes não apenas para auxiliar no controle dos artefatos como também para apoiar e auxiliar seu desenvolvimento, proporcionando diversas características positivas para este processo.Considerando essas informações e o conteúdo estudado sobre implementação arquitetural e controle de versão, analise as técnicas disponíveis a seguir e associe-as com suas respectivas características.1) Histórico de artefatos.2) Criação de tags.3) Criação de branchs.4) Confiança estrutural.(  ) Permite realizar a criação de novas linhas de desenvolvimento independentes do código fonte ou artefatos controlados.(  ) Apresenta o contexto de alterações realizadas em um artefato ou conjunto de artefatos, permitindo que se visualize a sua linha de alterações.(  ) Permite a criação de um snapshot temporal de um ou mais artefatos dentro do contexto de controle de versão.(  ) O uso de repositórios remotos ajuda a não perder arquivos por causa de eventos imponderáveis ou outros tipos de erros.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "3, 1, 2, 4. "
  },
  {
    "pergunta": "Para conseguirmos entender como aplicar e identificar os principais conceitos presentes na análise arquitetural, precisamos entender como eles funcionam e suas principais características. Uma das principais características que possuímos nesse contexto são as metas.Considerando as informações apresentadas e o conteúdo estudado, analise as afirmativas a seguir e assinale V para a(s) verdadeira(s) e F para a(s) falsa(s).I. (  ) As metas são elementos que devem ser definidos pelo analista de negócio de um projeto e com a aprovação do arquiteto de software, sem a participação dos stakeholders.II. (  ) As metas são elementos que devem ser definidos pelo arquiteto de sistemas em conjunto com os stakeholders, para assegurar o direcionamento correto do projeto e das implementações que serão realizadas.III. (  ) As metas podem ser categorizadas em 4 tipos, basicamente: completude, consistência, compatibilidade e corretude.IV. (  ) As metas auxiliam na identificação das fronteiras arquiteturais.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "F, V, V, F. "
  },
  {
    "pergunta": "Quando estamos realizando a análise arquitetural de um projeto ou sistema, algumas características devem ser observadas e analisadas em vários aspectos. O escopo é um aspecto extremamente importante e que auxiliará o arquiteto a mapear e representar o alcance da solução. O escopo pode ser quebrado em diferentes tipos.Considerando a informação apresentada e o conteúdo estudado sobre análise arquitetural e a caracterização de sistemas e sub-sistemas, analise as afirmativas a seguir:I. Sistema-Subsistema é um tipo de escopo no qual se verifica a relação entre o sistema principal e seus interrelacionamentos com os subsistemas, garantindo a composição dos mesmos.II. Componente-Conector visa garantir que haja um conector relacionado a um componente em todas as situações.III.  ",
    "resposta": "I e III. "
  },
  {
    "pergunta": "Um dos grandes desafios que temos, no desenvolvimento de softwares de grande porte e que possuem muitas integrações, é o de se ter uma solução estruturada, eficiente e com capacidade de fornecer formas de visualizar, de forma geral e detalhada, o funcionamento da arquitetura e do sistema como um todo.Considerando essas informações e o conteúdo estudado sobre frameworks arquiteturais, pode-se afirmar que o texto apresentado se refere ao framework DoDAF, porque: ",
    "resposta": "este framework de arquitetura é especialmente adequado para grandes sistemas com desafios complexos de integração e interoperabilidade, e é aparentemente único em seu emprego de visões operacionais. "
  },
  {
    "pergunta": "Um dos itens mais importantes quando se está na fase de implementação arquitetural é a definição de como os artefatos serão controlados e auditados. Para auxiliar nesse ponto, ferramentas de controle de versão podem ser utilizadas, a fim de permitir não apenas este tipo de controle como outras características, como marcações temporais.Considerando essas informações e o conteúdo estudado sobre implementação arquitetural, analise as afirmativas a seguir.I. O histórico de artefatos realiza o registro das modificações estruturais do projeto.II. A divisão do projeto em diferentes linhas de implementação é denominada de tag.III. A rastreabilidade é disponibilizada nas ferramentas de controle de versão por meio de recursos que permitam acesso a dados como local, estado e momento.IV. As ferramentas de controle de versão rejeitam o uso de repositórios remotos. ",
    "resposta": "I e III. "
  },
  {
    "pergunta": "Um dos padrões arquiteturais cuja utilização vem crescendo nos últimos anos é o Padrão do Quadro Negro. Devido à grande adoção de mecanismos não determinísticos, como reconhecimento de fala e tráfego, esse padrão vem amadurecendo e ganhando corpo no mundo corporativo.Baseando-se na informação apresentada e no conteúdo estudado sobre padrões arquiteturais, analise os requisitos não funcionais a seguir e associe-os à sua definição:1) Blackboard.2) Knowledge Source.3) Control Component.( ) Representa os módulos especialistas e suas representações.( ) Responsável por selecionar, configurar e executar os módulos.( ) Representa a memória global e estrutura de mapeamento.Agora, assinale a alternativa que apresenta a sequência correta: ",
    "resposta": "2, 3, 1. "
  }
  
]

